gitpan/zxid/c/saml2md-aux.c
/* c/saml2md-aux.c - WARNING: This file was automatically generated. DO NOT EDIT!
 * $Id: saml2md-aux.c,v 1.19 2006/09/05 05:09:39 sampo Exp $ */
/* Code generation design Copyright (c) 2006 Sampo Kellomaki (sampo@iki.fi),
 * All Rights Reserved. NO WARRANTY. See file COPYING for terms and conditions
 * of use. Some aspects of code generation were driven by schema
 * descriptions that were used as input and may be subject to their own copyright.
 * Code generation uses a template, whose copyright statement follows. */

/** aux-templ.c  -  Auxiliary functions template: cloning, freeing, walking data
 ** Copyright (c) 2006 Sampo Kellomaki (sampo@iki.fi), All Rights Reserved.
 ** This is confidential unpublished proprietary source code of the author.
 ** NO WARRANTY, not even implied warranties. Contains trade secrets.
 ** Distribution prohibited unless authorized in writing. See file COPYING.
 ** Id: aux-templ.c,v 1.8 2006/08/28 05:23:23 sampo Exp $
 **
 ** 30.5.2006, created, Sampo Kellomaki (sampo@iki.fi)
 ** 6.8.2006, factored from enc-templ.c to separate file --Sampo
 **
 ** N.B: wo=wire order (needed for exc-c14n), so=schema order
 **/

#include <memory.h>
#include "errmac.h"
#include "zx.h"
#include "c/saml2md-const.h"
#include "c/saml2md-data.h"



#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_CanonicalizationMethod
#define EL_STRUCT zxmd_ds_CanonicalizationMethod_s
#define EL_NS     ds
#define EL_TAG    CanonicalizationMethod

/* FUNC(zxmd_DUP_STRS_ds_CanonicalizationMethod) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_CanonicalizationMethod(struct zx_ctx* c, struct zxmd_ds_CanonicalizationMethod_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Algorithm);


}

/* FUNC(zxmd_DEEP_CLONE_ds_CanonicalizationMethod) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_CanonicalizationMethod_s* zxmd_DEEP_CLONE_ds_CanonicalizationMethod(struct zx_ctx* c, struct zxmd_ds_CanonicalizationMethod_s* x, int dup_strs)
{
  x = (struct zxmd_ds_CanonicalizationMethod_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_CanonicalizationMethod_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Algorithm = zx_clone_attr(c, x->Algorithm);


  return x;
}

/* FUNC(zxmd_FREE_ds_CanonicalizationMethod) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_CanonicalizationMethod(struct zx_ctx* c, struct zxmd_ds_CanonicalizationMethod_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Algorithm, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_CanonicalizationMethod) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_CanonicalizationMethod_s* zxmd_NEW_ds_CanonicalizationMethod(struct zx_ctx* c)
{
  struct zxmd_ds_CanonicalizationMethod_s* x = ZX_ZALLOC(c, struct zxmd_ds_CanonicalizationMethod_s);
  x->gg.g.tok = zxmd_ds_CanonicalizationMethod_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_CanonicalizationMethod) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_CanonicalizationMethod(struct zx_ctx* c, struct zxmd_ds_CanonicalizationMethod_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_CanonicalizationMethod) */

int zxmd_WALK_WO_ds_CanonicalizationMethod(struct zx_ctx* c, struct zxmd_ds_CanonicalizationMethod_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_DSAKeyValue
#define EL_STRUCT zxmd_ds_DSAKeyValue_s
#define EL_NS     ds
#define EL_TAG    DSAKeyValue

/* FUNC(zxmd_DUP_STRS_ds_DSAKeyValue) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_DSAKeyValue(struct zx_ctx* c, struct zxmd_ds_DSAKeyValue_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  zx_dup_strs_simple_elems(c, x->P);
  zx_dup_strs_simple_elems(c, x->Q);
  zx_dup_strs_simple_elems(c, x->G);
  zx_dup_strs_simple_elems(c, x->Y);
  zx_dup_strs_simple_elems(c, x->J);
  zx_dup_strs_simple_elems(c, x->Seed);
  zx_dup_strs_simple_elems(c, x->PgenCounter);

}

/* FUNC(zxmd_DEEP_CLONE_ds_DSAKeyValue) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_DSAKeyValue_s* zxmd_DEEP_CLONE_ds_DSAKeyValue(struct zx_ctx* c, struct zxmd_ds_DSAKeyValue_s* x, int dup_strs)
{
  x = (struct zxmd_ds_DSAKeyValue_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_DSAKeyValue_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


