gitpan/zxid/c/saml2md-aux.c
  x->P = zx_deep_clone_simple_elems(c,x->P, dup_strs);
  x->Q = zx_deep_clone_simple_elems(c,x->Q, dup_strs);
  x->G = zx_deep_clone_simple_elems(c,x->G, dup_strs);
  x->Y = zx_deep_clone_simple_elems(c,x->Y, dup_strs);
  x->J = zx_deep_clone_simple_elems(c,x->J, dup_strs);
  x->Seed = zx_deep_clone_simple_elems(c,x->Seed, dup_strs);
  x->PgenCounter = zx_deep_clone_simple_elems(c,x->PgenCounter, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_ds_DSAKeyValue) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_DSAKeyValue(struct zx_ctx* c, struct zxmd_ds_DSAKeyValue_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  zx_free_simple_elems(c, x->P, free_strs);
  zx_free_simple_elems(c, x->Q, free_strs);
  zx_free_simple_elems(c, x->G, free_strs);
  zx_free_simple_elems(c, x->Y, free_strs);
  zx_free_simple_elems(c, x->J, free_strs);
  zx_free_simple_elems(c, x->Seed, free_strs);
  zx_free_simple_elems(c, x->PgenCounter, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_DSAKeyValue) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_DSAKeyValue_s* zxmd_NEW_ds_DSAKeyValue(struct zx_ctx* c)
{
  struct zxmd_ds_DSAKeyValue_s* x = ZX_ZALLOC(c, struct zxmd_ds_DSAKeyValue_s);
  x->gg.g.tok = zxmd_ds_DSAKeyValue_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_DSAKeyValue) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_DSAKeyValue(struct zx_ctx* c, struct zxmd_ds_DSAKeyValue_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->P, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->Q, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->G, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->Y, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->J, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->Seed, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->PgenCounter, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_DSAKeyValue) */

int zxmd_WALK_WO_ds_DSAKeyValue(struct zx_ctx* c, struct zxmd_ds_DSAKeyValue_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_DigestMethod
#define EL_STRUCT zxmd_ds_DigestMethod_s
#define EL_NS     ds
#define EL_TAG    DigestMethod

/* FUNC(zxmd_DUP_STRS_ds_DigestMethod) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_DigestMethod(struct zx_ctx* c, struct zxmd_ds_DigestMethod_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Algorithm);


}

/* FUNC(zxmd_DEEP_CLONE_ds_DigestMethod) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_DigestMethod_s* zxmd_DEEP_CLONE_ds_DigestMethod(struct zx_ctx* c, struct zxmd_ds_DigestMethod_s* x, int dup_strs)
{
  x = (struct zxmd_ds_DigestMethod_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_DigestMethod_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Algorithm = zx_clone_attr(c, x->Algorithm);


  return x;
}

/* FUNC(zxmd_FREE_ds_DigestMethod) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_DigestMethod(struct zx_ctx* c, struct zxmd_ds_DigestMethod_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Algorithm, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_DigestMethod) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_DigestMethod_s* zxmd_NEW_ds_DigestMethod(struct zx_ctx* c)
{
  struct zxmd_ds_DigestMethod_s* x = ZX_ZALLOC(c, struct zxmd_ds_DigestMethod_s);
  x->gg.g.tok = zxmd_ds_DigestMethod_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_DigestMethod) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_DigestMethod(struct zx_ctx* c, struct zxmd_ds_DigestMethod_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_DigestMethod) */

int zxmd_WALK_WO_ds_DigestMethod(struct zx_ctx* c, struct zxmd_ds_DigestMethod_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_KeyInfo
#define EL_STRUCT zxmd_ds_KeyInfo_s
#define EL_NS     ds
#define EL_TAG    KeyInfo

