gitpan/zxid/c/saml2md-aux.c
struct zxmd_ds_Object_s* zxmd_DEEP_CLONE_ds_Object(struct zx_ctx* c, struct zxmd_ds_Object_s* x, int dup_strs)
{
  x = (struct zxmd_ds_Object_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_Object_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);
  x->MimeType = zx_clone_attr(c, x->MimeType);
  x->Encoding = zx_clone_attr(c, x->Encoding);


  return x;
}

/* FUNC(zxmd_FREE_ds_Object) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_Object(struct zx_ctx* c, struct zxmd_ds_Object_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);
  zx_free_attr(c, x->MimeType, free_strs);
  zx_free_attr(c, x->Encoding, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_Object) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_Object_s* zxmd_NEW_ds_Object(struct zx_ctx* c)
{
  struct zxmd_ds_Object_s* x = ZX_ZALLOC(c, struct zxmd_ds_Object_s);
  x->gg.g.tok = zxmd_ds_Object_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_Object) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_Object(struct zx_ctx* c, struct zxmd_ds_Object_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_Object) */

int zxmd_WALK_WO_ds_Object(struct zx_ctx* c, struct zxmd_ds_Object_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_PGPData
#define EL_STRUCT zxmd_ds_PGPData_s
#define EL_NS     ds
#define EL_TAG    PGPData

/* FUNC(zxmd_DUP_STRS_ds_PGPData) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_PGPData(struct zx_ctx* c, struct zxmd_ds_PGPData_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  zx_dup_strs_simple_elems(c, x->PGPKeyID);
  zx_dup_strs_simple_elems(c, x->PGPKeyPacket);

}

/* FUNC(zxmd_DEEP_CLONE_ds_PGPData) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_PGPData_s* zxmd_DEEP_CLONE_ds_PGPData(struct zx_ctx* c, struct zxmd_ds_PGPData_s* x, int dup_strs)
{
  x = (struct zxmd_ds_PGPData_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_PGPData_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  x->PGPKeyID = zx_deep_clone_simple_elems(c,x->PGPKeyID, dup_strs);
  x->PGPKeyPacket = zx_deep_clone_simple_elems(c,x->PGPKeyPacket, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_ds_PGPData) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_PGPData(struct zx_ctx* c, struct zxmd_ds_PGPData_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  zx_free_simple_elems(c, x->PGPKeyID, free_strs);
  zx_free_simple_elems(c, x->PGPKeyPacket, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_PGPData) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_PGPData_s* zxmd_NEW_ds_PGPData(struct zx_ctx* c)
{
  struct zxmd_ds_PGPData_s* x = ZX_ZALLOC(c, struct zxmd_ds_PGPData_s);
  x->gg.g.tok = zxmd_ds_PGPData_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_PGPData) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_PGPData(struct zx_ctx* c, struct zxmd_ds_PGPData_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->PGPKeyID, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->PGPKeyPacket, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_PGPData) */

int zxmd_WALK_WO_ds_PGPData(struct zx_ctx* c, struct zxmd_ds_PGPData_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_RSAKeyValue
#define EL_STRUCT zxmd_ds_RSAKeyValue_s
#define EL_NS     ds
#define EL_TAG    RSAKeyValue

/* FUNC(zxmd_DUP_STRS_ds_RSAKeyValue) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_RSAKeyValue(struct zx_ctx* c, struct zxmd_ds_RSAKeyValue_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


