gitpan/zxid/c/saml2md-aux.c
  zx_dup_strs_simple_elems(c, x->Modulus);
  zx_dup_strs_simple_elems(c, x->Exponent);

}

/* FUNC(zxmd_DEEP_CLONE_ds_RSAKeyValue) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_RSAKeyValue_s* zxmd_DEEP_CLONE_ds_RSAKeyValue(struct zx_ctx* c, struct zxmd_ds_RSAKeyValue_s* x, int dup_strs)
{
  x = (struct zxmd_ds_RSAKeyValue_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_RSAKeyValue_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  x->Modulus = zx_deep_clone_simple_elems(c,x->Modulus, dup_strs);
  x->Exponent = zx_deep_clone_simple_elems(c,x->Exponent, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_ds_RSAKeyValue) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_RSAKeyValue(struct zx_ctx* c, struct zxmd_ds_RSAKeyValue_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  zx_free_simple_elems(c, x->Modulus, free_strs);
  zx_free_simple_elems(c, x->Exponent, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_RSAKeyValue) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_RSAKeyValue_s* zxmd_NEW_ds_RSAKeyValue(struct zx_ctx* c)
{
  struct zxmd_ds_RSAKeyValue_s* x = ZX_ZALLOC(c, struct zxmd_ds_RSAKeyValue_s);
  x->gg.g.tok = zxmd_ds_RSAKeyValue_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_RSAKeyValue) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_RSAKeyValue(struct zx_ctx* c, struct zxmd_ds_RSAKeyValue_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->Modulus, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->Exponent, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_RSAKeyValue) */

int zxmd_WALK_WO_ds_RSAKeyValue(struct zx_ctx* c, struct zxmd_ds_RSAKeyValue_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_Reference
#define EL_STRUCT zxmd_ds_Reference_s
#define EL_NS     ds
#define EL_TAG    Reference

/* FUNC(zxmd_DUP_STRS_ds_Reference) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_Reference(struct zx_ctx* c, struct zxmd_ds_Reference_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Id);
  zx_dup_attr(c, x->URI);
  zx_dup_attr(c, x->Type);

  {
      struct zxmd_ds_Transforms_s* e;
      for (e = x->Transforms; e; e = (struct zxmd_ds_Transforms_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Transforms(c, e);
  }
  {
      struct zxmd_ds_DigestMethod_s* e;
      for (e = x->DigestMethod; e; e = (struct zxmd_ds_DigestMethod_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_DigestMethod(c, e);
  }
  zx_dup_strs_simple_elems(c, x->DigestValue);

}

/* FUNC(zxmd_DEEP_CLONE_ds_Reference) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_Reference_s* zxmd_DEEP_CLONE_ds_Reference(struct zx_ctx* c, struct zxmd_ds_Reference_s* x, int dup_strs)
{
  x = (struct zxmd_ds_Reference_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_Reference_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);
  x->URI = zx_clone_attr(c, x->URI);
  x->Type = zx_clone_attr(c, x->Type);

  {
      struct zxmd_ds_Transforms_s* e;
      struct zxmd_ds_Transforms_s* en;
      struct zxmd_ds_Transforms_s* enn;
      for (enn = 0, e = x->Transforms; e; e = (struct zxmd_ds_Transforms_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Transforms(c, e, dup_strs);
	  if (!enn)
	      x->Transforms = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_DigestMethod_s* e;
      struct zxmd_ds_DigestMethod_s* en;
      struct zxmd_ds_DigestMethod_s* enn;
      for (enn = 0, e = x->DigestMethod; e; e = (struct zxmd_ds_DigestMethod_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_DigestMethod(c, e, dup_strs);
	  if (!enn)
	      x->DigestMethod = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  x->DigestValue = zx_deep_clone_simple_elems(c,x->DigestValue, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_ds_Reference) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_Reference(struct zx_ctx* c, struct zxmd_ds_Reference_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);
  zx_free_attr(c, x->URI, free_strs);
  zx_free_attr(c, x->Type, free_strs);

  {
      struct zxmd_ds_Transforms_s* e;
      struct zxmd_ds_Transforms_s* en;
      for (e = x->Transforms; e; e = en) {
	  en = (struct zxmd_ds_Transforms_s*)e->gg.g.n;
	  zxmd_FREE_ds_Transforms(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_DigestMethod_s* e;
      struct zxmd_ds_DigestMethod_s* en;
      for (e = x->DigestMethod; e; e = en) {
	  en = (struct zxmd_ds_DigestMethod_s*)e->gg.g.n;
	  zxmd_FREE_ds_DigestMethod(c, e, free_strs);
      }
  }
  zx_free_simple_elems(c, x->DigestValue, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_Reference) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_Reference_s* zxmd_NEW_ds_Reference(struct zx_ctx* c)
{
  struct zxmd_ds_Reference_s* x = ZX_ZALLOC(c, struct zxmd_ds_Reference_s);
  x->gg.g.tok = zxmd_ds_Reference_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_Reference) */

