gitpan/zxid/c/saml2md-aux.c
}

/* FUNC(zxmd_DEEP_CLONE_ds_SPKIData) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_SPKIData_s* zxmd_DEEP_CLONE_ds_SPKIData(struct zx_ctx* c, struct zxmd_ds_SPKIData_s* x, int dup_strs)
{
  x = (struct zxmd_ds_SPKIData_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_SPKIData_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  x->SPKISexp = zx_deep_clone_simple_elems(c,x->SPKISexp, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_ds_SPKIData) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_SPKIData(struct zx_ctx* c, struct zxmd_ds_SPKIData_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  zx_free_simple_elems(c, x->SPKISexp, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_SPKIData) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_SPKIData_s* zxmd_NEW_ds_SPKIData(struct zx_ctx* c)
{
  struct zxmd_ds_SPKIData_s* x = ZX_ZALLOC(c, struct zxmd_ds_SPKIData_s);
  x->gg.g.tok = zxmd_ds_SPKIData_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_SPKIData) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_SPKIData(struct zx_ctx* c, struct zxmd_ds_SPKIData_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->SPKISexp, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_SPKIData) */

int zxmd_WALK_WO_ds_SPKIData(struct zx_ctx* c, struct zxmd_ds_SPKIData_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_Signature
#define EL_STRUCT zxmd_ds_Signature_s
#define EL_NS     ds
#define EL_TAG    Signature

/* FUNC(zxmd_DUP_STRS_ds_Signature) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_Signature(struct zx_ctx* c, struct zxmd_ds_Signature_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Id);

  {
      struct zxmd_ds_SignedInfo_s* e;
      for (e = x->SignedInfo; e; e = (struct zxmd_ds_SignedInfo_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_SignedInfo(c, e);
  }
  {
      struct zxmd_ds_SignatureValue_s* e;
      for (e = x->SignatureValue; e; e = (struct zxmd_ds_SignatureValue_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_SignatureValue(c, e);
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_KeyInfo(c, e);
  }
  {
      struct zxmd_ds_Object_s* e;
      for (e = x->Object; e; e = (struct zxmd_ds_Object_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Object(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_ds_Signature) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_Signature_s* zxmd_DEEP_CLONE_ds_Signature(struct zx_ctx* c, struct zxmd_ds_Signature_s* x, int dup_strs)
{
  x = (struct zxmd_ds_Signature_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_Signature_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);

  {
      struct zxmd_ds_SignedInfo_s* e;
      struct zxmd_ds_SignedInfo_s* en;
      struct zxmd_ds_SignedInfo_s* enn;
      for (enn = 0, e = x->SignedInfo; e; e = (struct zxmd_ds_SignedInfo_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_SignedInfo(c, e, dup_strs);
	  if (!enn)
	      x->SignedInfo = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_SignatureValue_s* e;
      struct zxmd_ds_SignatureValue_s* en;
      struct zxmd_ds_SignatureValue_s* enn;
      for (enn = 0, e = x->SignatureValue; e; e = (struct zxmd_ds_SignatureValue_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_SignatureValue(c, e, dup_strs);
	  if (!enn)
	      x->SignatureValue = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      struct zxmd_ds_KeyInfo_s* en;
      struct zxmd_ds_KeyInfo_s* enn;
      for (enn = 0, e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_KeyInfo(c, e, dup_strs);
	  if (!enn)
	      x->KeyInfo = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_Object_s* e;
      struct zxmd_ds_Object_s* en;
      struct zxmd_ds_Object_s* enn;
      for (enn = 0, e = x->Object; e; e = (struct zxmd_ds_Object_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Object(c, e, dup_strs);
	  if (!enn)
	      x->Object = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_ds_Signature) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_Signature(struct zx_ctx* c, struct zxmd_ds_Signature_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);

  {
      struct zxmd_ds_SignedInfo_s* e;
      struct zxmd_ds_SignedInfo_s* en;
      for (e = x->SignedInfo; e; e = en) {
	  en = (struct zxmd_ds_SignedInfo_s*)e->gg.g.n;
	  zxmd_FREE_ds_SignedInfo(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_SignatureValue_s* e;
      struct zxmd_ds_SignatureValue_s* en;
      for (e = x->SignatureValue; e; e = en) {
	  en = (struct zxmd_ds_SignatureValue_s*)e->gg.g.n;
	  zxmd_FREE_ds_SignatureValue(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      struct zxmd_ds_KeyInfo_s* en;
      for (e = x->KeyInfo; e; e = en) {
	  en = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n;
	  zxmd_FREE_ds_KeyInfo(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_Object_s* e;
      struct zxmd_ds_Object_s* en;
      for (e = x->Object; e; e = en) {
	  en = (struct zxmd_ds_Object_s*)e->gg.g.n;
	  zxmd_FREE_ds_Object(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_Signature) */

/* Trivial allocator/constructor for the datatype. */

