gitpan/zxid/c/saml2md-aux.c
struct zxmd_ds_Signature_s* zxmd_NEW_ds_Signature(struct zx_ctx* c)
{
  struct zxmd_ds_Signature_s* x = ZX_ZALLOC(c, struct zxmd_ds_Signature_s);
  x->gg.g.tok = zxmd_ds_Signature_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_Signature) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_Signature(struct zx_ctx* c, struct zxmd_ds_Signature_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_ds_SignedInfo_s* e;
      for (e = x->SignedInfo; e; e = (struct zxmd_ds_SignedInfo_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_SignedInfo(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_SignatureValue_s* e;
      for (e = x->SignatureValue; e; e = (struct zxmd_ds_SignatureValue_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_SignatureValue(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_KeyInfo(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_Object_s* e;
      for (e = x->Object; e; e = (struct zxmd_ds_Object_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_Object(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_Signature) */

int zxmd_WALK_WO_ds_Signature(struct zx_ctx* c, struct zxmd_ds_Signature_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_SignatureMethod
#define EL_STRUCT zxmd_ds_SignatureMethod_s
#define EL_NS     ds
#define EL_TAG    SignatureMethod

/* FUNC(zxmd_DUP_STRS_ds_SignatureMethod) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_SignatureMethod(struct zx_ctx* c, struct zxmd_ds_SignatureMethod_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Algorithm);

  zx_dup_strs_simple_elems(c, x->HMACOutputLength);

}

/* FUNC(zxmd_DEEP_CLONE_ds_SignatureMethod) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_SignatureMethod_s* zxmd_DEEP_CLONE_ds_SignatureMethod(struct zx_ctx* c, struct zxmd_ds_SignatureMethod_s* x, int dup_strs)
{
  x = (struct zxmd_ds_SignatureMethod_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_SignatureMethod_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Algorithm = zx_clone_attr(c, x->Algorithm);

  x->HMACOutputLength = zx_deep_clone_simple_elems(c,x->HMACOutputLength, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_ds_SignatureMethod) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_SignatureMethod(struct zx_ctx* c, struct zxmd_ds_SignatureMethod_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Algorithm, free_strs);

  zx_free_simple_elems(c, x->HMACOutputLength, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_SignatureMethod) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_SignatureMethod_s* zxmd_NEW_ds_SignatureMethod(struct zx_ctx* c)
{
  struct zxmd_ds_SignatureMethod_s* x = ZX_ZALLOC(c, struct zxmd_ds_SignatureMethod_s);
  x->gg.g.tok = zxmd_ds_SignatureMethod_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_SignatureMethod) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_SignatureMethod(struct zx_ctx* c, struct zxmd_ds_SignatureMethod_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->HMACOutputLength, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_SignatureMethod) */

int zxmd_WALK_WO_ds_SignatureMethod(struct zx_ctx* c, struct zxmd_ds_SignatureMethod_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_SignatureProperties
#define EL_STRUCT zxmd_ds_SignatureProperties_s
#define EL_NS     ds
#define EL_TAG    SignatureProperties

/* FUNC(zxmd_DUP_STRS_ds_SignatureProperties) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

