gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_NEW_ds_SignatureProperty) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_SignatureProperty_s* zxmd_NEW_ds_SignatureProperty(struct zx_ctx* c)
{
  struct zxmd_ds_SignatureProperty_s* x = ZX_ZALLOC(c, struct zxmd_ds_SignatureProperty_s);
  x->gg.g.tok = zxmd_ds_SignatureProperty_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_SignatureProperty) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_SignatureProperty(struct zx_ctx* c, struct zxmd_ds_SignatureProperty_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_SignatureProperty) */

int zxmd_WALK_WO_ds_SignatureProperty(struct zx_ctx* c, struct zxmd_ds_SignatureProperty_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_SignatureValue
#define EL_STRUCT zxmd_ds_SignatureValue_s
#define EL_NS     ds
#define EL_TAG    SignatureValue

/* FUNC(zxmd_DUP_STRS_ds_SignatureValue) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_SignatureValue(struct zx_ctx* c, struct zxmd_ds_SignatureValue_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Id);


}

/* FUNC(zxmd_DEEP_CLONE_ds_SignatureValue) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_SignatureValue_s* zxmd_DEEP_CLONE_ds_SignatureValue(struct zx_ctx* c, struct zxmd_ds_SignatureValue_s* x, int dup_strs)
{
  x = (struct zxmd_ds_SignatureValue_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_SignatureValue_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);


  return x;
}

/* FUNC(zxmd_FREE_ds_SignatureValue) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_SignatureValue(struct zx_ctx* c, struct zxmd_ds_SignatureValue_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_SignatureValue) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_SignatureValue_s* zxmd_NEW_ds_SignatureValue(struct zx_ctx* c)
{
  struct zxmd_ds_SignatureValue_s* x = ZX_ZALLOC(c, struct zxmd_ds_SignatureValue_s);
  x->gg.g.tok = zxmd_ds_SignatureValue_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_SignatureValue) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_SignatureValue(struct zx_ctx* c, struct zxmd_ds_SignatureValue_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_SignatureValue) */

int zxmd_WALK_WO_ds_SignatureValue(struct zx_ctx* c, struct zxmd_ds_SignatureValue_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_SignedInfo
#define EL_STRUCT zxmd_ds_SignedInfo_s
#define EL_NS     ds
#define EL_TAG    SignedInfo

/* FUNC(zxmd_DUP_STRS_ds_SignedInfo) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_SignedInfo(struct zx_ctx* c, struct zxmd_ds_SignedInfo_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Id);

  {
      struct zxmd_ds_CanonicalizationMethod_s* e;
      for (e = x->CanonicalizationMethod; e; e = (struct zxmd_ds_CanonicalizationMethod_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_CanonicalizationMethod(c, e);
  }
  {
      struct zxmd_ds_SignatureMethod_s* e;
      for (e = x->SignatureMethod; e; e = (struct zxmd_ds_SignatureMethod_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_SignatureMethod(c, e);
  }
  {
      struct zxmd_ds_Reference_s* e;
      for (e = x->Reference; e; e = (struct zxmd_ds_Reference_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Reference(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_ds_SignedInfo) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_SignedInfo_s* zxmd_DEEP_CLONE_ds_SignedInfo(struct zx_ctx* c, struct zxmd_ds_SignedInfo_s* x, int dup_strs)
{
  x = (struct zxmd_ds_SignedInfo_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_SignedInfo_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);

  {
      struct zxmd_ds_CanonicalizationMethod_s* e;
      struct zxmd_ds_CanonicalizationMethod_s* en;
      struct zxmd_ds_CanonicalizationMethod_s* enn;
      for (enn = 0, e = x->CanonicalizationMethod; e; e = (struct zxmd_ds_CanonicalizationMethod_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_CanonicalizationMethod(c, e, dup_strs);
	  if (!enn)
	      x->CanonicalizationMethod = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_SignatureMethod_s* e;
      struct zxmd_ds_SignatureMethod_s* en;
      struct zxmd_ds_SignatureMethod_s* enn;
      for (enn = 0, e = x->SignatureMethod; e; e = (struct zxmd_ds_SignatureMethod_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_SignatureMethod(c, e, dup_strs);
	  if (!enn)
	      x->SignatureMethod = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_Reference_s* e;
      struct zxmd_ds_Reference_s* en;
      struct zxmd_ds_Reference_s* enn;
      for (enn = 0, e = x->Reference; e; e = (struct zxmd_ds_Reference_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Reference(c, e, dup_strs);
	  if (!enn)
	      x->Reference = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_ds_SignedInfo) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_SignedInfo(struct zx_ctx* c, struct zxmd_ds_SignedInfo_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);

  {
      struct zxmd_ds_CanonicalizationMethod_s* e;
      struct zxmd_ds_CanonicalizationMethod_s* en;
      for (e = x->CanonicalizationMethod; e; e = en) {
	  en = (struct zxmd_ds_CanonicalizationMethod_s*)e->gg.g.n;
	  zxmd_FREE_ds_CanonicalizationMethod(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_SignatureMethod_s* e;
      struct zxmd_ds_SignatureMethod_s* en;
      for (e = x->SignatureMethod; e; e = en) {
	  en = (struct zxmd_ds_SignatureMethod_s*)e->gg.g.n;
	  zxmd_FREE_ds_SignatureMethod(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_Reference_s* e;
      struct zxmd_ds_Reference_s* en;
      for (e = x->Reference; e; e = en) {
	  en = (struct zxmd_ds_Reference_s*)e->gg.g.n;
	  zxmd_FREE_ds_Reference(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_SignedInfo) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_SignedInfo_s* zxmd_NEW_ds_SignedInfo(struct zx_ctx* c)
{
  struct zxmd_ds_SignedInfo_s* x = ZX_ZALLOC(c, struct zxmd_ds_SignedInfo_s);
  x->gg.g.tok = zxmd_ds_SignedInfo_ELEM;
  return x;
}

