gitpan/zxid/c/saml2md-aux.c
#define EL_NAME   ds_X509IssuerSerial
#define EL_STRUCT zxmd_ds_X509IssuerSerial_s
#define EL_NS     ds
#define EL_TAG    X509IssuerSerial

/* FUNC(zxmd_DUP_STRS_ds_X509IssuerSerial) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_ds_X509IssuerSerial(struct zx_ctx* c, struct zxmd_ds_X509IssuerSerial_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  zx_dup_strs_simple_elems(c, x->X509IssuerName);
  zx_dup_strs_simple_elems(c, x->X509SerialNumber);

}

/* FUNC(zxmd_DEEP_CLONE_ds_X509IssuerSerial) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_ds_X509IssuerSerial_s* zxmd_DEEP_CLONE_ds_X509IssuerSerial(struct zx_ctx* c, struct zxmd_ds_X509IssuerSerial_s* x, int dup_strs)
{
  x = (struct zxmd_ds_X509IssuerSerial_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_ds_X509IssuerSerial_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  x->X509IssuerName = zx_deep_clone_simple_elems(c,x->X509IssuerName, dup_strs);
  x->X509SerialNumber = zx_deep_clone_simple_elems(c,x->X509SerialNumber, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_ds_X509IssuerSerial) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_ds_X509IssuerSerial(struct zx_ctx* c, struct zxmd_ds_X509IssuerSerial_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  zx_free_simple_elems(c, x->X509IssuerName, free_strs);
  zx_free_simple_elems(c, x->X509SerialNumber, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_ds_X509IssuerSerial) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_ds_X509IssuerSerial_s* zxmd_NEW_ds_X509IssuerSerial(struct zx_ctx* c)
{
  struct zxmd_ds_X509IssuerSerial_s* x = ZX_ZALLOC(c, struct zxmd_ds_X509IssuerSerial_s);
  x->gg.g.tok = zxmd_ds_X509IssuerSerial_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_ds_X509IssuerSerial) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_ds_X509IssuerSerial(struct zx_ctx* c, struct zxmd_ds_X509IssuerSerial_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->X509IssuerName, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->X509SerialNumber, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_ds_X509IssuerSerial) */

int zxmd_WALK_WO_ds_X509IssuerSerial(struct zx_ctx* c, struct zxmd_ds_X509IssuerSerial_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_AdditionalMetadataLocation
#define EL_STRUCT zxmd_md_AdditionalMetadataLocation_s
#define EL_NS     md
#define EL_TAG    AdditionalMetadataLocation

/* FUNC(zxmd_DUP_STRS_md_AdditionalMetadataLocation) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_AdditionalMetadataLocation(struct zx_ctx* c, struct zxmd_md_AdditionalMetadataLocation_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->namespace);


}

/* FUNC(zxmd_DEEP_CLONE_md_AdditionalMetadataLocation) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_AdditionalMetadataLocation_s* zxmd_DEEP_CLONE_md_AdditionalMetadataLocation(struct zx_ctx* c, struct zxmd_md_AdditionalMetadataLocation_s* x, int dup_strs)
{
  x = (struct zxmd_md_AdditionalMetadataLocation_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_AdditionalMetadataLocation_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->namespace = zx_clone_attr(c, x->namespace);


  return x;
}

/* FUNC(zxmd_FREE_md_AdditionalMetadataLocation) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_AdditionalMetadataLocation(struct zx_ctx* c, struct zxmd_md_AdditionalMetadataLocation_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->namespace, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_AdditionalMetadataLocation) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_AdditionalMetadataLocation_s* zxmd_NEW_md_AdditionalMetadataLocation(struct zx_ctx* c)
{
  struct zxmd_md_AdditionalMetadataLocation_s* x = ZX_ZALLOC(c, struct zxmd_md_AdditionalMetadataLocation_s);
  x->gg.g.tok = zxmd_md_AdditionalMetadataLocation_ELEM;
  return x;
}

