gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_WALK_SO_md_AdditionalMetadataLocation) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_AdditionalMetadataLocation(struct zx_ctx* c, struct zxmd_md_AdditionalMetadataLocation_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_md_AdditionalMetadataLocation) */

int zxmd_WALK_WO_md_AdditionalMetadataLocation(struct zx_ctx* c, struct zxmd_md_AdditionalMetadataLocation_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_AffiliationDescriptor
#define EL_STRUCT zxmd_md_AffiliationDescriptor_s
#define EL_NS     md
#define EL_TAG    AffiliationDescriptor

/* FUNC(zxmd_DUP_STRS_md_AffiliationDescriptor) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_AffiliationDescriptor(struct zx_ctx* c, struct zxmd_md_AffiliationDescriptor_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->affiliationOwnerID);
  zx_dup_attr(c, x->validUntil);
  zx_dup_attr(c, x->cacheDuration);
  zx_dup_attr(c, x->ID);

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Signature(c, e);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Extensions(c, e);
  }
  zx_dup_strs_simple_elems(c, x->AffiliateMember);
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_KeyDescriptor(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_md_AffiliationDescriptor) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_AffiliationDescriptor_s* zxmd_DEEP_CLONE_md_AffiliationDescriptor(struct zx_ctx* c, struct zxmd_md_AffiliationDescriptor_s* x, int dup_strs)
{
  x = (struct zxmd_md_AffiliationDescriptor_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_AffiliationDescriptor_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->affiliationOwnerID = zx_clone_attr(c, x->affiliationOwnerID);
  x->validUntil = zx_clone_attr(c, x->validUntil);
  x->cacheDuration = zx_clone_attr(c, x->cacheDuration);
  x->ID = zx_clone_attr(c, x->ID);

  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      struct zxmd_ds_Signature_s* enn;
      for (enn = 0, e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Signature(c, e, dup_strs);
	  if (!enn)
	      x->Signature = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      struct zxmd_md_Extensions_s* enn;
      for (enn = 0, e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_Extensions(c, e, dup_strs);
	  if (!enn)
	      x->Extensions = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  x->AffiliateMember = zx_deep_clone_simple_elems(c,x->AffiliateMember, dup_strs);
  {
      struct zxmd_md_KeyDescriptor_s* e;
      struct zxmd_md_KeyDescriptor_s* en;
      struct zxmd_md_KeyDescriptor_s* enn;
      for (enn = 0, e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_KeyDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->KeyDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_md_AffiliationDescriptor) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_AffiliationDescriptor(struct zx_ctx* c, struct zxmd_md_AffiliationDescriptor_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->affiliationOwnerID, free_strs);
  zx_free_attr(c, x->validUntil, free_strs);
  zx_free_attr(c, x->cacheDuration, free_strs);
  zx_free_attr(c, x->ID, free_strs);

  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      for (e = x->Signature; e; e = en) {
	  en = (struct zxmd_ds_Signature_s*)e->gg.g.n;
	  zxmd_FREE_ds_Signature(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      for (e = x->Extensions; e; e = en) {
	  en = (struct zxmd_md_Extensions_s*)e->gg.g.n;
	  zxmd_FREE_md_Extensions(c, e, free_strs);
      }
  }
  zx_free_simple_elems(c, x->AffiliateMember, free_strs);
  {
      struct zxmd_md_KeyDescriptor_s* e;
      struct zxmd_md_KeyDescriptor_s* en;
      for (e = x->KeyDescriptor; e; e = en) {
	  en = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_KeyDescriptor(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_AffiliationDescriptor) */

/* Trivial allocator/constructor for the datatype. */

