gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_FREE_md_AttributeAuthorityDescriptor) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_AttributeAuthorityDescriptor(struct zx_ctx* c, struct zxmd_md_AttributeAuthorityDescriptor_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->ID, free_strs);
  zx_free_attr(c, x->validUntil, free_strs);
  zx_free_attr(c, x->cacheDuration, free_strs);
  zx_free_attr(c, x->protocolSupportEnumeration, free_strs);
  zx_free_attr(c, x->errorURL, free_strs);

  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      for (e = x->Signature; e; e = en) {
	  en = (struct zxmd_ds_Signature_s*)e->gg.g.n;
	  zxmd_FREE_ds_Signature(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      for (e = x->Extensions; e; e = en) {
	  en = (struct zxmd_md_Extensions_s*)e->gg.g.n;
	  zxmd_FREE_md_Extensions(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      struct zxmd_md_KeyDescriptor_s* en;
      for (e = x->KeyDescriptor; e; e = en) {
	  en = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_KeyDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      struct zxmd_md_Organization_s* en;
      for (e = x->Organization; e; e = en) {
	  en = (struct zxmd_md_Organization_s*)e->gg.g.n;
	  zxmd_FREE_md_Organization(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      struct zxmd_md_ContactPerson_s* en;
      for (e = x->ContactPerson; e; e = en) {
	  en = (struct zxmd_md_ContactPerson_s*)e->gg.g.n;
	  zxmd_FREE_md_ContactPerson(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_AttributeService_s* e;
      struct zxmd_md_AttributeService_s* en;
      for (e = x->AttributeService; e; e = en) {
	  en = (struct zxmd_md_AttributeService_s*)e->gg.g.n;
	  zxmd_FREE_md_AttributeService(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_AssertionIDRequestService_s* e;
      struct zxmd_md_AssertionIDRequestService_s* en;
      for (e = x->AssertionIDRequestService; e; e = en) {
	  en = (struct zxmd_md_AssertionIDRequestService_s*)e->gg.g.n;
	  zxmd_FREE_md_AssertionIDRequestService(c, e, free_strs);
      }
  }
  zx_free_simple_elems(c, x->NameIDFormat, free_strs);
  zx_free_simple_elems(c, x->AttributeProfile, free_strs);
  {
      struct zxmd_sa_Attribute_s* e;
      struct zxmd_sa_Attribute_s* en;
      for (e = x->Attribute; e; e = en) {
	  en = (struct zxmd_sa_Attribute_s*)e->gg.g.n;
	  zxmd_FREE_sa_Attribute(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_AttributeAuthorityDescriptor) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_AttributeAuthorityDescriptor_s* zxmd_NEW_md_AttributeAuthorityDescriptor(struct zx_ctx* c)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* x = ZX_ZALLOC(c, struct zxmd_md_AttributeAuthorityDescriptor_s);
  x->gg.g.tok = zxmd_md_AttributeAuthorityDescriptor_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_md_AttributeAuthorityDescriptor) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_AttributeAuthorityDescriptor(struct zx_ctx* c, struct zxmd_md_AttributeAuthorityDescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_Signature(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Extensions(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_KeyDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Organization(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ContactPerson(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_AttributeService_s* e;
      for (e = x->AttributeService; e; e = (struct zxmd_md_AttributeService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_AttributeService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_AssertionIDRequestService_s* e;
      for (e = x->AssertionIDRequestService; e; e = (struct zxmd_md_AssertionIDRequestService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_AssertionIDRequestService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  ret = zx_walk_so_simple_elems(c, x->NameIDFormat, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->AttributeProfile, ctx, callback);
  if (ret)
    return ret;
  {
      struct zxmd_sa_Attribute_s* e;
      for (e = x->Attribute; e; e = (struct zxmd_sa_Attribute_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_Attribute(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_md_AttributeAuthorityDescriptor) */

int zxmd_WALK_WO_md_AttributeAuthorityDescriptor(struct zx_ctx* c, struct zxmd_md_AttributeAuthorityDescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_AttributeConsumingService
#define EL_STRUCT zxmd_md_AttributeConsumingService_s
#define EL_NS     md
#define EL_TAG    AttributeConsumingService

