gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_DUP_STRS_md_AttributeConsumingService) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_AttributeConsumingService(struct zx_ctx* c, struct zxmd_md_AttributeConsumingService_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->index);
  zx_dup_attr(c, x->isDefault);

  {
      struct zxmd_md_ServiceName_s* e;
      for (e = x->ServiceName; e; e = (struct zxmd_md_ServiceName_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_ServiceName(c, e);
  }
  {
      struct zxmd_md_ServiceDescription_s* e;
      for (e = x->ServiceDescription; e; e = (struct zxmd_md_ServiceDescription_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_ServiceDescription(c, e);
  }
  {
      struct zxmd_md_RequestedAttribute_s* e;
      for (e = x->RequestedAttribute; e; e = (struct zxmd_md_RequestedAttribute_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_RequestedAttribute(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_md_AttributeConsumingService) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_AttributeConsumingService_s* zxmd_DEEP_CLONE_md_AttributeConsumingService(struct zx_ctx* c, struct zxmd_md_AttributeConsumingService_s* x, int dup_strs)
{
  x = (struct zxmd_md_AttributeConsumingService_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_AttributeConsumingService_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->index = zx_clone_attr(c, x->index);
  x->isDefault = zx_clone_attr(c, x->isDefault);

  {
      struct zxmd_md_ServiceName_s* e;
      struct zxmd_md_ServiceName_s* en;
      struct zxmd_md_ServiceName_s* enn;
      for (enn = 0, e = x->ServiceName; e; e = (struct zxmd_md_ServiceName_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_ServiceName(c, e, dup_strs);
	  if (!enn)
	      x->ServiceName = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_ServiceDescription_s* e;
      struct zxmd_md_ServiceDescription_s* en;
      struct zxmd_md_ServiceDescription_s* enn;
      for (enn = 0, e = x->ServiceDescription; e; e = (struct zxmd_md_ServiceDescription_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_ServiceDescription(c, e, dup_strs);
	  if (!enn)
	      x->ServiceDescription = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_RequestedAttribute_s* e;
      struct zxmd_md_RequestedAttribute_s* en;
      struct zxmd_md_RequestedAttribute_s* enn;
      for (enn = 0, e = x->RequestedAttribute; e; e = (struct zxmd_md_RequestedAttribute_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_RequestedAttribute(c, e, dup_strs);
	  if (!enn)
	      x->RequestedAttribute = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_md_AttributeConsumingService) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_AttributeConsumingService(struct zx_ctx* c, struct zxmd_md_AttributeConsumingService_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->index, free_strs);
  zx_free_attr(c, x->isDefault, free_strs);

  {
      struct zxmd_md_ServiceName_s* e;
      struct zxmd_md_ServiceName_s* en;
      for (e = x->ServiceName; e; e = en) {
	  en = (struct zxmd_md_ServiceName_s*)e->gg.g.n;
	  zxmd_FREE_md_ServiceName(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_ServiceDescription_s* e;
      struct zxmd_md_ServiceDescription_s* en;
      for (e = x->ServiceDescription; e; e = en) {
	  en = (struct zxmd_md_ServiceDescription_s*)e->gg.g.n;
	  zxmd_FREE_md_ServiceDescription(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_RequestedAttribute_s* e;
      struct zxmd_md_RequestedAttribute_s* en;
      for (e = x->RequestedAttribute; e; e = en) {
	  en = (struct zxmd_md_RequestedAttribute_s*)e->gg.g.n;
	  zxmd_FREE_md_RequestedAttribute(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_AttributeConsumingService) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_AttributeConsumingService_s* zxmd_NEW_md_AttributeConsumingService(struct zx_ctx* c)
{
  struct zxmd_md_AttributeConsumingService_s* x = ZX_ZALLOC(c, struct zxmd_md_AttributeConsumingService_s);
  x->gg.g.tok = zxmd_md_AttributeConsumingService_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_md_AttributeConsumingService) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_AttributeConsumingService(struct zx_ctx* c, struct zxmd_md_AttributeConsumingService_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_md_ServiceName_s* e;
      for (e = x->ServiceName; e; e = (struct zxmd_md_ServiceName_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ServiceName(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_ServiceDescription_s* e;
      for (e = x->ServiceDescription; e; e = (struct zxmd_md_ServiceDescription_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ServiceDescription(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_RequestedAttribute_s* e;
      for (e = x->RequestedAttribute; e; e = (struct zxmd_md_RequestedAttribute_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_RequestedAttribute(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

