gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_WALK_WO_md_AttributeConsumingService) */

int zxmd_WALK_WO_md_AttributeConsumingService(struct zx_ctx* c, struct zxmd_md_AttributeConsumingService_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_AttributeService
#define EL_STRUCT zxmd_md_AttributeService_s
#define EL_NS     md
#define EL_TAG    AttributeService

/* FUNC(zxmd_DUP_STRS_md_AttributeService) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_AttributeService(struct zx_ctx* c, struct zxmd_md_AttributeService_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Binding);
  zx_dup_attr(c, x->Location);
  zx_dup_attr(c, x->ResponseLocation);


}

/* FUNC(zxmd_DEEP_CLONE_md_AttributeService) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_AttributeService_s* zxmd_DEEP_CLONE_md_AttributeService(struct zx_ctx* c, struct zxmd_md_AttributeService_s* x, int dup_strs)
{
  x = (struct zxmd_md_AttributeService_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_AttributeService_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Binding = zx_clone_attr(c, x->Binding);
  x->Location = zx_clone_attr(c, x->Location);
  x->ResponseLocation = zx_clone_attr(c, x->ResponseLocation);


  return x;
}

/* FUNC(zxmd_FREE_md_AttributeService) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_AttributeService(struct zx_ctx* c, struct zxmd_md_AttributeService_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Binding, free_strs);
  zx_free_attr(c, x->Location, free_strs);
  zx_free_attr(c, x->ResponseLocation, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_AttributeService) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_AttributeService_s* zxmd_NEW_md_AttributeService(struct zx_ctx* c)
{
  struct zxmd_md_AttributeService_s* x = ZX_ZALLOC(c, struct zxmd_md_AttributeService_s);
  x->gg.g.tok = zxmd_md_AttributeService_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_md_AttributeService) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_AttributeService(struct zx_ctx* c, struct zxmd_md_AttributeService_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_md_AttributeService) */

int zxmd_WALK_WO_md_AttributeService(struct zx_ctx* c, struct zxmd_md_AttributeService_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_AuthnAuthorityDescriptor
#define EL_STRUCT zxmd_md_AuthnAuthorityDescriptor_s
#define EL_NS     md
#define EL_TAG    AuthnAuthorityDescriptor

/* FUNC(zxmd_DUP_STRS_md_AuthnAuthorityDescriptor) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_AuthnAuthorityDescriptor(struct zx_ctx* c, struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->ID);
  zx_dup_attr(c, x->validUntil);
  zx_dup_attr(c, x->cacheDuration);
  zx_dup_attr(c, x->protocolSupportEnumeration);
  zx_dup_attr(c, x->errorURL);

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Signature(c, e);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Extensions(c, e);
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_KeyDescriptor(c, e);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Organization(c, e);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_ContactPerson(c, e);
  }
  {
      struct zxmd_md_AuthnQueryService_s* e;
      for (e = x->AuthnQueryService; e; e = (struct zxmd_md_AuthnQueryService_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AuthnQueryService(c, e);
  }
  {
      struct zxmd_md_AssertionIDRequestService_s* e;
      for (e = x->AssertionIDRequestService; e; e = (struct zxmd_md_AssertionIDRequestService_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AssertionIDRequestService(c, e);
  }
  zx_dup_strs_simple_elems(c, x->NameIDFormat);

