gitpan/zxid/c/saml2md-aux.c
  zx_dup_attr(c, x->entityID);
  zx_dup_attr(c, x->validUntil);
  zx_dup_attr(c, x->cacheDuration);
  zx_dup_attr(c, x->ID);

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Signature(c, e);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Extensions(c, e);
  }
  {
      struct zxmd_md_RoleDescriptor_s* e;
      for (e = x->RoleDescriptor; e; e = (struct zxmd_md_RoleDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_RoleDescriptor(c, e);
  }
  {
      struct zxmd_md_IDPSSODescriptor_s* e;
      for (e = x->IDPSSODescriptor; e; e = (struct zxmd_md_IDPSSODescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_IDPSSODescriptor(c, e);
  }
  {
      struct zxmd_md_SPSSODescriptor_s* e;
      for (e = x->SPSSODescriptor; e; e = (struct zxmd_md_SPSSODescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_SPSSODescriptor(c, e);
  }
  {
      struct zxmd_md_AuthnAuthorityDescriptor_s* e;
      for (e = x->AuthnAuthorityDescriptor; e; e = (struct zxmd_md_AuthnAuthorityDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AuthnAuthorityDescriptor(c, e);
  }
  {
      struct zxmd_md_AttributeAuthorityDescriptor_s* e;
      for (e = x->AttributeAuthorityDescriptor; e; e = (struct zxmd_md_AttributeAuthorityDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AttributeAuthorityDescriptor(c, e);
  }
  {
      struct zxmd_md_PDPDescriptor_s* e;
      for (e = x->PDPDescriptor; e; e = (struct zxmd_md_PDPDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_PDPDescriptor(c, e);
  }
  {
      struct zxmd_md_AffiliationDescriptor_s* e;
      for (e = x->AffiliationDescriptor; e; e = (struct zxmd_md_AffiliationDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AffiliationDescriptor(c, e);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Organization(c, e);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_ContactPerson(c, e);
  }
  {
      struct zxmd_md_AdditionalMetadataLocation_s* e;
      for (e = x->AdditionalMetadataLocation; e; e = (struct zxmd_md_AdditionalMetadataLocation_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AdditionalMetadataLocation(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_md_EntityDescriptor) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_EntityDescriptor_s* zxmd_DEEP_CLONE_md_EntityDescriptor(struct zx_ctx* c, struct zxmd_md_EntityDescriptor_s* x, int dup_strs)
{
  x = (struct zxmd_md_EntityDescriptor_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_EntityDescriptor_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->entityID = zx_clone_attr(c, x->entityID);
  x->validUntil = zx_clone_attr(c, x->validUntil);
  x->cacheDuration = zx_clone_attr(c, x->cacheDuration);
  x->ID = zx_clone_attr(c, x->ID);

  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      struct zxmd_ds_Signature_s* enn;
      for (enn = 0, e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Signature(c, e, dup_strs);
	  if (!enn)
	      x->Signature = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      struct zxmd_md_Extensions_s* enn;
      for (enn = 0, e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_Extensions(c, e, dup_strs);
	  if (!enn)
	      x->Extensions = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_RoleDescriptor_s* e;
      struct zxmd_md_RoleDescriptor_s* en;
      struct zxmd_md_RoleDescriptor_s* enn;
      for (enn = 0, e = x->RoleDescriptor; e; e = (struct zxmd_md_RoleDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_RoleDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->RoleDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_IDPSSODescriptor_s* e;
      struct zxmd_md_IDPSSODescriptor_s* en;
      struct zxmd_md_IDPSSODescriptor_s* enn;
      for (enn = 0, e = x->IDPSSODescriptor; e; e = (struct zxmd_md_IDPSSODescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_IDPSSODescriptor(c, e, dup_strs);
	  if (!enn)
	      x->IDPSSODescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_SPSSODescriptor_s* e;
      struct zxmd_md_SPSSODescriptor_s* en;
      struct zxmd_md_SPSSODescriptor_s* enn;
      for (enn = 0, e = x->SPSSODescriptor; e; e = (struct zxmd_md_SPSSODescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_SPSSODescriptor(c, e, dup_strs);
	  if (!enn)
	      x->SPSSODescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_AuthnAuthorityDescriptor_s* e;
      struct zxmd_md_AuthnAuthorityDescriptor_s* en;
      struct zxmd_md_AuthnAuthorityDescriptor_s* enn;
      for (enn = 0, e = x->AuthnAuthorityDescriptor; e; e = (struct zxmd_md_AuthnAuthorityDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_AuthnAuthorityDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->AuthnAuthorityDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_AttributeAuthorityDescriptor_s* e;
      struct zxmd_md_AttributeAuthorityDescriptor_s* en;
      struct zxmd_md_AttributeAuthorityDescriptor_s* enn;
      for (enn = 0, e = x->AttributeAuthorityDescriptor; e; e = (struct zxmd_md_AttributeAuthorityDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_AttributeAuthorityDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->AttributeAuthorityDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_PDPDescriptor_s* e;
      struct zxmd_md_PDPDescriptor_s* en;
      struct zxmd_md_PDPDescriptor_s* enn;
      for (enn = 0, e = x->PDPDescriptor; e; e = (struct zxmd_md_PDPDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_PDPDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->PDPDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_AffiliationDescriptor_s* e;
      struct zxmd_md_AffiliationDescriptor_s* en;
      struct zxmd_md_AffiliationDescriptor_s* enn;
      for (enn = 0, e = x->AffiliationDescriptor; e; e = (struct zxmd_md_AffiliationDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_AffiliationDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->AffiliationDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      struct zxmd_md_Organization_s* en;
      struct zxmd_md_Organization_s* enn;
      for (enn = 0, e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_Organization(c, e, dup_strs);
	  if (!enn)
	      x->Organization = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      struct zxmd_md_ContactPerson_s* en;
      struct zxmd_md_ContactPerson_s* enn;
      for (enn = 0, e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_ContactPerson(c, e, dup_strs);
	  if (!enn)
	      x->ContactPerson = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_AdditionalMetadataLocation_s* e;
      struct zxmd_md_AdditionalMetadataLocation_s* en;
      struct zxmd_md_AdditionalMetadataLocation_s* enn;
      for (enn = 0, e = x->AdditionalMetadataLocation; e; e = (struct zxmd_md_AdditionalMetadataLocation_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_AdditionalMetadataLocation(c, e, dup_strs);
	  if (!enn)
	      x->AdditionalMetadataLocation = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_md_EntityDescriptor) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_EntityDescriptor(struct zx_ctx* c, struct zxmd_md_EntityDescriptor_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->entityID, free_strs);
  zx_free_attr(c, x->validUntil, free_strs);
  zx_free_attr(c, x->cacheDuration, free_strs);
  zx_free_attr(c, x->ID, free_strs);

  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      for (e = x->Signature; e; e = en) {
	  en = (struct zxmd_ds_Signature_s*)e->gg.g.n;
	  zxmd_FREE_ds_Signature(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      for (e = x->Extensions; e; e = en) {
	  en = (struct zxmd_md_Extensions_s*)e->gg.g.n;
	  zxmd_FREE_md_Extensions(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_RoleDescriptor_s* e;
      struct zxmd_md_RoleDescriptor_s* en;
      for (e = x->RoleDescriptor; e; e = en) {
	  en = (struct zxmd_md_RoleDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_RoleDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_IDPSSODescriptor_s* e;
      struct zxmd_md_IDPSSODescriptor_s* en;
      for (e = x->IDPSSODescriptor; e; e = en) {
	  en = (struct zxmd_md_IDPSSODescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_IDPSSODescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_SPSSODescriptor_s* e;
      struct zxmd_md_SPSSODescriptor_s* en;
      for (e = x->SPSSODescriptor; e; e = en) {
	  en = (struct zxmd_md_SPSSODescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_SPSSODescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_AuthnAuthorityDescriptor_s* e;
      struct zxmd_md_AuthnAuthorityDescriptor_s* en;
      for (e = x->AuthnAuthorityDescriptor; e; e = en) {
	  en = (struct zxmd_md_AuthnAuthorityDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_AuthnAuthorityDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_AttributeAuthorityDescriptor_s* e;
      struct zxmd_md_AttributeAuthorityDescriptor_s* en;
      for (e = x->AttributeAuthorityDescriptor; e; e = en) {
	  en = (struct zxmd_md_AttributeAuthorityDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_AttributeAuthorityDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_PDPDescriptor_s* e;
      struct zxmd_md_PDPDescriptor_s* en;
      for (e = x->PDPDescriptor; e; e = en) {
	  en = (struct zxmd_md_PDPDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_PDPDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_AffiliationDescriptor_s* e;
      struct zxmd_md_AffiliationDescriptor_s* en;
      for (e = x->AffiliationDescriptor; e; e = en) {
	  en = (struct zxmd_md_AffiliationDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_AffiliationDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      struct zxmd_md_Organization_s* en;
      for (e = x->Organization; e; e = en) {
	  en = (struct zxmd_md_Organization_s*)e->gg.g.n;
	  zxmd_FREE_md_Organization(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      struct zxmd_md_ContactPerson_s* en;
      for (e = x->ContactPerson; e; e = en) {
	  en = (struct zxmd_md_ContactPerson_s*)e->gg.g.n;
	  zxmd_FREE_md_ContactPerson(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_AdditionalMetadataLocation_s* e;
      struct zxmd_md_AdditionalMetadataLocation_s* en;
      for (e = x->AdditionalMetadataLocation; e; e = en) {
	  en = (struct zxmd_md_AdditionalMetadataLocation_s*)e->gg.g.n;
	  zxmd_FREE_md_AdditionalMetadataLocation(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_EntityDescriptor) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_EntityDescriptor_s* zxmd_NEW_md_EntityDescriptor(struct zx_ctx* c)
{
  struct zxmd_md_EntityDescriptor_s* x = ZX_ZALLOC(c, struct zxmd_md_EntityDescriptor_s);
  x->gg.g.tok = zxmd_md_EntityDescriptor_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_md_EntityDescriptor) */

