gitpan/zxid/c/saml2md-aux.c
/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_EntityDescriptor(struct zx_ctx* c, struct zxmd_md_EntityDescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_Signature(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Extensions(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_RoleDescriptor_s* e;
      for (e = x->RoleDescriptor; e; e = (struct zxmd_md_RoleDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_RoleDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_IDPSSODescriptor_s* e;
      for (e = x->IDPSSODescriptor; e; e = (struct zxmd_md_IDPSSODescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_IDPSSODescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_SPSSODescriptor_s* e;
      for (e = x->SPSSODescriptor; e; e = (struct zxmd_md_SPSSODescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_SPSSODescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_AuthnAuthorityDescriptor_s* e;
      for (e = x->AuthnAuthorityDescriptor; e; e = (struct zxmd_md_AuthnAuthorityDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_AuthnAuthorityDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_AttributeAuthorityDescriptor_s* e;
      for (e = x->AttributeAuthorityDescriptor; e; e = (struct zxmd_md_AttributeAuthorityDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_AttributeAuthorityDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_PDPDescriptor_s* e;
      for (e = x->PDPDescriptor; e; e = (struct zxmd_md_PDPDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_PDPDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_AffiliationDescriptor_s* e;
      for (e = x->AffiliationDescriptor; e; e = (struct zxmd_md_AffiliationDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_AffiliationDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Organization(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ContactPerson(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_AdditionalMetadataLocation_s* e;
      for (e = x->AdditionalMetadataLocation; e; e = (struct zxmd_md_AdditionalMetadataLocation_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_AdditionalMetadataLocation(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_md_EntityDescriptor) */

int zxmd_WALK_WO_md_EntityDescriptor(struct zx_ctx* c, struct zxmd_md_EntityDescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_Extensions
#define EL_STRUCT zxmd_md_Extensions_s
#define EL_NS     md
#define EL_TAG    Extensions

/* FUNC(zxmd_DUP_STRS_md_Extensions) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_Extensions(struct zx_ctx* c, struct zxmd_md_Extensions_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */



}

/* FUNC(zxmd_DEEP_CLONE_md_Extensions) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_Extensions_s* zxmd_DEEP_CLONE_md_Extensions(struct zx_ctx* c, struct zxmd_md_Extensions_s* x, int dup_strs)
{
  x = (struct zxmd_md_Extensions_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_Extensions_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */



  return x;
}

/* FUNC(zxmd_FREE_md_Extensions) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_Extensions(struct zx_ctx* c, struct zxmd_md_Extensions_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */




  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_Extensions) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_Extensions_s* zxmd_NEW_md_Extensions(struct zx_ctx* c)
{
  struct zxmd_md_Extensions_s* x = ZX_ZALLOC(c, struct zxmd_md_Extensions_s);
  x->gg.g.tok = zxmd_md_Extensions_ELEM;
  return x;
}

