gitpan/zxid/c/saml2md-aux.c
/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_IDPSSODescriptor(struct zx_ctx* c, struct zxmd_md_IDPSSODescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_Signature(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Extensions(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_KeyDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Organization(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ContactPerson(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_ArtifactResolutionService_s* e;
      for (e = x->ArtifactResolutionService; e; e = (struct zxmd_md_ArtifactResolutionService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ArtifactResolutionService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_SingleLogoutService_s* e;
      for (e = x->SingleLogoutService; e; e = (struct zxmd_md_SingleLogoutService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_SingleLogoutService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_ManageNameIDService_s* e;
      for (e = x->ManageNameIDService; e; e = (struct zxmd_md_ManageNameIDService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ManageNameIDService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  ret = zx_walk_so_simple_elems(c, x->NameIDFormat, ctx, callback);
  if (ret)
    return ret;
  {
      struct zxmd_md_SingleSignOnService_s* e;
      for (e = x->SingleSignOnService; e; e = (struct zxmd_md_SingleSignOnService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_SingleSignOnService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_NameIDMappingService_s* e;
      for (e = x->NameIDMappingService; e; e = (struct zxmd_md_NameIDMappingService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_NameIDMappingService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_AssertionIDRequestService_s* e;
      for (e = x->AssertionIDRequestService; e; e = (struct zxmd_md_AssertionIDRequestService_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_AssertionIDRequestService(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  ret = zx_walk_so_simple_elems(c, x->AttributeProfile, ctx, callback);
  if (ret)
    return ret;
  {
      struct zxmd_sa_Attribute_s* e;
      for (e = x->Attribute; e; e = (struct zxmd_sa_Attribute_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_Attribute(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_md_IDPSSODescriptor) */

int zxmd_WALK_WO_md_IDPSSODescriptor(struct zx_ctx* c, struct zxmd_md_IDPSSODescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_KeyDescriptor
#define EL_STRUCT zxmd_md_KeyDescriptor_s
#define EL_NS     md
#define EL_TAG    KeyDescriptor

/* FUNC(zxmd_DUP_STRS_md_KeyDescriptor) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_KeyDescriptor(struct zx_ctx* c, struct zxmd_md_KeyDescriptor_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->use);

  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_KeyInfo(c, e);
  }
  {
      struct zxmd_md_EncryptionMethod_s* e;
      for (e = x->EncryptionMethod; e; e = (struct zxmd_md_EncryptionMethod_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_EncryptionMethod(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_md_KeyDescriptor) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_KeyDescriptor_s* zxmd_DEEP_CLONE_md_KeyDescriptor(struct zx_ctx* c, struct zxmd_md_KeyDescriptor_s* x, int dup_strs)
{
  x = (struct zxmd_md_KeyDescriptor_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_KeyDescriptor_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->use = zx_clone_attr(c, x->use);

  {
      struct zxmd_ds_KeyInfo_s* e;
      struct zxmd_ds_KeyInfo_s* en;
      struct zxmd_ds_KeyInfo_s* enn;
      for (enn = 0, e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_KeyInfo(c, e, dup_strs);
	  if (!enn)
	      x->KeyInfo = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_EncryptionMethod_s* e;
      struct zxmd_md_EncryptionMethod_s* en;
      struct zxmd_md_EncryptionMethod_s* enn;
      for (enn = 0, e = x->EncryptionMethod; e; e = (struct zxmd_md_EncryptionMethod_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_EncryptionMethod(c, e, dup_strs);
	  if (!enn)
	      x->EncryptionMethod = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_md_KeyDescriptor) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_KeyDescriptor(struct zx_ctx* c, struct zxmd_md_KeyDescriptor_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->use, free_strs);

  {
      struct zxmd_ds_KeyInfo_s* e;
      struct zxmd_ds_KeyInfo_s* en;
      for (e = x->KeyInfo; e; e = en) {
	  en = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n;
	  zxmd_FREE_ds_KeyInfo(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_EncryptionMethod_s* e;
      struct zxmd_md_EncryptionMethod_s* en;
      for (e = x->EncryptionMethod; e; e = en) {
	  en = (struct zxmd_md_EncryptionMethod_s*)e->gg.g.n;
	  zxmd_FREE_md_EncryptionMethod(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_KeyDescriptor) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_KeyDescriptor_s* zxmd_NEW_md_KeyDescriptor(struct zx_ctx* c)
{
  struct zxmd_md_KeyDescriptor_s* x = ZX_ZALLOC(c, struct zxmd_md_KeyDescriptor_s);
  x->gg.g.tok = zxmd_md_KeyDescriptor_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_md_KeyDescriptor) */

