gitpan/zxid/c/saml2md-aux.c
struct zxmd_md_NameIDMappingService_s* zxmd_DEEP_CLONE_md_NameIDMappingService(struct zx_ctx* c, struct zxmd_md_NameIDMappingService_s* x, int dup_strs)
{
  x = (struct zxmd_md_NameIDMappingService_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_NameIDMappingService_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Binding = zx_clone_attr(c, x->Binding);
  x->Location = zx_clone_attr(c, x->Location);
  x->ResponseLocation = zx_clone_attr(c, x->ResponseLocation);


  return x;
}

/* FUNC(zxmd_FREE_md_NameIDMappingService) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_NameIDMappingService(struct zx_ctx* c, struct zxmd_md_NameIDMappingService_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Binding, free_strs);
  zx_free_attr(c, x->Location, free_strs);
  zx_free_attr(c, x->ResponseLocation, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_NameIDMappingService) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_NameIDMappingService_s* zxmd_NEW_md_NameIDMappingService(struct zx_ctx* c)
{
  struct zxmd_md_NameIDMappingService_s* x = ZX_ZALLOC(c, struct zxmd_md_NameIDMappingService_s);
  x->gg.g.tok = zxmd_md_NameIDMappingService_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_md_NameIDMappingService) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_NameIDMappingService(struct zx_ctx* c, struct zxmd_md_NameIDMappingService_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_md_NameIDMappingService) */

int zxmd_WALK_WO_md_NameIDMappingService(struct zx_ctx* c, struct zxmd_md_NameIDMappingService_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_Organization
#define EL_STRUCT zxmd_md_Organization_s
#define EL_NS     md
#define EL_TAG    Organization

/* FUNC(zxmd_DUP_STRS_md_Organization) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_Organization(struct zx_ctx* c, struct zxmd_md_Organization_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Extensions(c, e);
  }
  {
      struct zxmd_md_OrganizationName_s* e;
      for (e = x->OrganizationName; e; e = (struct zxmd_md_OrganizationName_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_OrganizationName(c, e);
  }
  {
      struct zxmd_md_OrganizationDisplayName_s* e;
      for (e = x->OrganizationDisplayName; e; e = (struct zxmd_md_OrganizationDisplayName_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_OrganizationDisplayName(c, e);
  }
  {
      struct zxmd_md_OrganizationURL_s* e;
      for (e = x->OrganizationURL; e; e = (struct zxmd_md_OrganizationURL_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_OrganizationURL(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_md_Organization) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_Organization_s* zxmd_DEEP_CLONE_md_Organization(struct zx_ctx* c, struct zxmd_md_Organization_s* x, int dup_strs)
{
  x = (struct zxmd_md_Organization_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_Organization_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      struct zxmd_md_Extensions_s* enn;
      for (enn = 0, e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_Extensions(c, e, dup_strs);
	  if (!enn)
	      x->Extensions = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_OrganizationName_s* e;
      struct zxmd_md_OrganizationName_s* en;
      struct zxmd_md_OrganizationName_s* enn;
      for (enn = 0, e = x->OrganizationName; e; e = (struct zxmd_md_OrganizationName_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_OrganizationName(c, e, dup_strs);
	  if (!enn)
	      x->OrganizationName = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_OrganizationDisplayName_s* e;
      struct zxmd_md_OrganizationDisplayName_s* en;
      struct zxmd_md_OrganizationDisplayName_s* enn;
      for (enn = 0, e = x->OrganizationDisplayName; e; e = (struct zxmd_md_OrganizationDisplayName_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_OrganizationDisplayName(c, e, dup_strs);
	  if (!enn)
	      x->OrganizationDisplayName = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_OrganizationURL_s* e;
      struct zxmd_md_OrganizationURL_s* en;
      struct zxmd_md_OrganizationURL_s* enn;
      for (enn = 0, e = x->OrganizationURL; e; e = (struct zxmd_md_OrganizationURL_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_OrganizationURL(c, e, dup_strs);
	  if (!enn)
	      x->OrganizationURL = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_md_Organization) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_Organization(struct zx_ctx* c, struct zxmd_md_Organization_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      for (e = x->Extensions; e; e = en) {
	  en = (struct zxmd_md_Extensions_s*)e->gg.g.n;
	  zxmd_FREE_md_Extensions(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_OrganizationName_s* e;
      struct zxmd_md_OrganizationName_s* en;
      for (e = x->OrganizationName; e; e = en) {
	  en = (struct zxmd_md_OrganizationName_s*)e->gg.g.n;
	  zxmd_FREE_md_OrganizationName(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_OrganizationDisplayName_s* e;
      struct zxmd_md_OrganizationDisplayName_s* en;
      for (e = x->OrganizationDisplayName; e; e = en) {
	  en = (struct zxmd_md_OrganizationDisplayName_s*)e->gg.g.n;
	  zxmd_FREE_md_OrganizationDisplayName(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_OrganizationURL_s* e;
      struct zxmd_md_OrganizationURL_s* en;
      for (e = x->OrganizationURL; e; e = en) {
	  en = (struct zxmd_md_OrganizationURL_s*)e->gg.g.n;
	  zxmd_FREE_md_OrganizationURL(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_Organization) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_Organization_s* zxmd_NEW_md_Organization(struct zx_ctx* c)
{
  struct zxmd_md_Organization_s* x = ZX_ZALLOC(c, struct zxmd_md_Organization_s);
  x->gg.g.tok = zxmd_md_Organization_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_md_Organization) */

