gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_WALK_SO_md_RoleDescriptor) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_md_RoleDescriptor(struct zx_ctx* c, struct zxmd_md_RoleDescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_Signature(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Extensions(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_KeyDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_Organization(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_ContactPerson(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_md_RoleDescriptor) */

int zxmd_WALK_WO_md_RoleDescriptor(struct zx_ctx* c, struct zxmd_md_RoleDescriptor_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   md_SPSSODescriptor
#define EL_STRUCT zxmd_md_SPSSODescriptor_s
#define EL_NS     md
#define EL_TAG    SPSSODescriptor

/* FUNC(zxmd_DUP_STRS_md_SPSSODescriptor) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_md_SPSSODescriptor(struct zx_ctx* c, struct zxmd_md_SPSSODescriptor_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->ID);
  zx_dup_attr(c, x->validUntil);
  zx_dup_attr(c, x->cacheDuration);
  zx_dup_attr(c, x->protocolSupportEnumeration);
  zx_dup_attr(c, x->errorURL);
  zx_dup_attr(c, x->AuthnRequestsSigned);
  zx_dup_attr(c, x->WantAssertionsSigned);

  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Signature(c, e);
  }
  {
      struct zxmd_md_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Extensions(c, e);
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      for (e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_KeyDescriptor(c, e);
  }
  {
      struct zxmd_md_Organization_s* e;
      for (e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_Organization(c, e);
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      for (e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_ContactPerson(c, e);
  }
  {
      struct zxmd_md_ArtifactResolutionService_s* e;
      for (e = x->ArtifactResolutionService; e; e = (struct zxmd_md_ArtifactResolutionService_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_ArtifactResolutionService(c, e);
  }
  {
      struct zxmd_md_SingleLogoutService_s* e;
      for (e = x->SingleLogoutService; e; e = (struct zxmd_md_SingleLogoutService_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_SingleLogoutService(c, e);
  }
  {
      struct zxmd_md_ManageNameIDService_s* e;
      for (e = x->ManageNameIDService; e; e = (struct zxmd_md_ManageNameIDService_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_ManageNameIDService(c, e);
  }
  zx_dup_strs_simple_elems(c, x->NameIDFormat);
  {
      struct zxmd_md_AssertionConsumerService_s* e;
      for (e = x->AssertionConsumerService; e; e = (struct zxmd_md_AssertionConsumerService_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AssertionConsumerService(c, e);
  }
  {
      struct zxmd_md_AttributeConsumingService_s* e;
      for (e = x->AttributeConsumingService; e; e = (struct zxmd_md_AttributeConsumingService_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_AttributeConsumingService(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_md_SPSSODescriptor) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_md_SPSSODescriptor_s* zxmd_DEEP_CLONE_md_SPSSODescriptor(struct zx_ctx* c, struct zxmd_md_SPSSODescriptor_s* x, int dup_strs)
{
  x = (struct zxmd_md_SPSSODescriptor_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_md_SPSSODescriptor_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->ID = zx_clone_attr(c, x->ID);
  x->validUntil = zx_clone_attr(c, x->validUntil);
  x->cacheDuration = zx_clone_attr(c, x->cacheDuration);
  x->protocolSupportEnumeration = zx_clone_attr(c, x->protocolSupportEnumeration);
  x->errorURL = zx_clone_attr(c, x->errorURL);
  x->AuthnRequestsSigned = zx_clone_attr(c, x->AuthnRequestsSigned);
  x->WantAssertionsSigned = zx_clone_attr(c, x->WantAssertionsSigned);

  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      struct zxmd_ds_Signature_s* enn;
      for (enn = 0, e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Signature(c, e, dup_strs);
	  if (!enn)
	      x->Signature = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      struct zxmd_md_Extensions_s* enn;
      for (enn = 0, e = x->Extensions; e; e = (struct zxmd_md_Extensions_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_Extensions(c, e, dup_strs);
	  if (!enn)
	      x->Extensions = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      struct zxmd_md_KeyDescriptor_s* en;
      struct zxmd_md_KeyDescriptor_s* enn;
      for (enn = 0, e = x->KeyDescriptor; e; e = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_KeyDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->KeyDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      struct zxmd_md_Organization_s* en;
      struct zxmd_md_Organization_s* enn;
      for (enn = 0, e = x->Organization; e; e = (struct zxmd_md_Organization_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_Organization(c, e, dup_strs);
	  if (!enn)
	      x->Organization = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      struct zxmd_md_ContactPerson_s* en;
      struct zxmd_md_ContactPerson_s* enn;
      for (enn = 0, e = x->ContactPerson; e; e = (struct zxmd_md_ContactPerson_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_ContactPerson(c, e, dup_strs);
	  if (!enn)
	      x->ContactPerson = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_ArtifactResolutionService_s* e;
      struct zxmd_md_ArtifactResolutionService_s* en;
      struct zxmd_md_ArtifactResolutionService_s* enn;
      for (enn = 0, e = x->ArtifactResolutionService; e; e = (struct zxmd_md_ArtifactResolutionService_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_ArtifactResolutionService(c, e, dup_strs);
	  if (!enn)
	      x->ArtifactResolutionService = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_SingleLogoutService_s* e;
      struct zxmd_md_SingleLogoutService_s* en;
      struct zxmd_md_SingleLogoutService_s* enn;
      for (enn = 0, e = x->SingleLogoutService; e; e = (struct zxmd_md_SingleLogoutService_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_SingleLogoutService(c, e, dup_strs);
	  if (!enn)
	      x->SingleLogoutService = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_ManageNameIDService_s* e;
      struct zxmd_md_ManageNameIDService_s* en;
      struct zxmd_md_ManageNameIDService_s* enn;
      for (enn = 0, e = x->ManageNameIDService; e; e = (struct zxmd_md_ManageNameIDService_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_ManageNameIDService(c, e, dup_strs);
	  if (!enn)
	      x->ManageNameIDService = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  x->NameIDFormat = zx_deep_clone_simple_elems(c,x->NameIDFormat, dup_strs);
  {
      struct zxmd_md_AssertionConsumerService_s* e;
      struct zxmd_md_AssertionConsumerService_s* en;
      struct zxmd_md_AssertionConsumerService_s* enn;
      for (enn = 0, e = x->AssertionConsumerService; e; e = (struct zxmd_md_AssertionConsumerService_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_AssertionConsumerService(c, e, dup_strs);
	  if (!enn)
	      x->AssertionConsumerService = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_AttributeConsumingService_s* e;
      struct zxmd_md_AttributeConsumingService_s* en;
      struct zxmd_md_AttributeConsumingService_s* enn;
      for (enn = 0, e = x->AttributeConsumingService; e; e = (struct zxmd_md_AttributeConsumingService_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_AttributeConsumingService(c, e, dup_strs);
	  if (!enn)
	      x->AttributeConsumingService = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_md_SPSSODescriptor) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_md_SPSSODescriptor(struct zx_ctx* c, struct zxmd_md_SPSSODescriptor_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->ID, free_strs);
  zx_free_attr(c, x->validUntil, free_strs);
  zx_free_attr(c, x->cacheDuration, free_strs);
  zx_free_attr(c, x->protocolSupportEnumeration, free_strs);
  zx_free_attr(c, x->errorURL, free_strs);
  zx_free_attr(c, x->AuthnRequestsSigned, free_strs);
  zx_free_attr(c, x->WantAssertionsSigned, free_strs);

  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      for (e = x->Signature; e; e = en) {
	  en = (struct zxmd_ds_Signature_s*)e->gg.g.n;
	  zxmd_FREE_ds_Signature(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_Extensions_s* e;
      struct zxmd_md_Extensions_s* en;
      for (e = x->Extensions; e; e = en) {
	  en = (struct zxmd_md_Extensions_s*)e->gg.g.n;
	  zxmd_FREE_md_Extensions(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_KeyDescriptor_s* e;
      struct zxmd_md_KeyDescriptor_s* en;
      for (e = x->KeyDescriptor; e; e = en) {
	  en = (struct zxmd_md_KeyDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_KeyDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_Organization_s* e;
      struct zxmd_md_Organization_s* en;
      for (e = x->Organization; e; e = en) {
	  en = (struct zxmd_md_Organization_s*)e->gg.g.n;
	  zxmd_FREE_md_Organization(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_ContactPerson_s* e;
      struct zxmd_md_ContactPerson_s* en;
      for (e = x->ContactPerson; e; e = en) {
	  en = (struct zxmd_md_ContactPerson_s*)e->gg.g.n;
	  zxmd_FREE_md_ContactPerson(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_ArtifactResolutionService_s* e;
      struct zxmd_md_ArtifactResolutionService_s* en;
      for (e = x->ArtifactResolutionService; e; e = en) {
	  en = (struct zxmd_md_ArtifactResolutionService_s*)e->gg.g.n;
	  zxmd_FREE_md_ArtifactResolutionService(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_SingleLogoutService_s* e;
      struct zxmd_md_SingleLogoutService_s* en;
      for (e = x->SingleLogoutService; e; e = en) {
	  en = (struct zxmd_md_SingleLogoutService_s*)e->gg.g.n;
	  zxmd_FREE_md_SingleLogoutService(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_ManageNameIDService_s* e;
      struct zxmd_md_ManageNameIDService_s* en;
      for (e = x->ManageNameIDService; e; e = en) {
	  en = (struct zxmd_md_ManageNameIDService_s*)e->gg.g.n;
	  zxmd_FREE_md_ManageNameIDService(c, e, free_strs);
      }
  }
  zx_free_simple_elems(c, x->NameIDFormat, free_strs);
  {
      struct zxmd_md_AssertionConsumerService_s* e;
      struct zxmd_md_AssertionConsumerService_s* en;
      for (e = x->AssertionConsumerService; e; e = en) {
	  en = (struct zxmd_md_AssertionConsumerService_s*)e->gg.g.n;
	  zxmd_FREE_md_AssertionConsumerService(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_AttributeConsumingService_s* e;
      struct zxmd_md_AttributeConsumingService_s* en;
      for (e = x->AttributeConsumingService; e; e = en) {
	  en = (struct zxmd_md_AttributeConsumingService_s*)e->gg.g.n;
	  zxmd_FREE_md_AttributeConsumingService(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_md_SPSSODescriptor) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_md_SPSSODescriptor_s* zxmd_NEW_md_SPSSODescriptor(struct zx_ctx* c)
{
  struct zxmd_md_SPSSODescriptor_s* x = ZX_ZALLOC(c, struct zxmd_md_SPSSODescriptor_s);
  x->gg.g.tok = zxmd_md_SPSSODescriptor_ELEM;
  return x;
}

