gitpan/zxid/c/saml2md-aux.c
}

/* FUNC(zxmd_DEEP_CLONE_sa_Action) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_Action_s* zxmd_DEEP_CLONE_sa_Action(struct zx_ctx* c, struct zxmd_sa_Action_s* x, int dup_strs)
{
  x = (struct zxmd_sa_Action_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_Action_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Namespace = zx_clone_attr(c, x->Namespace);


  return x;
}

/* FUNC(zxmd_FREE_sa_Action) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_Action(struct zx_ctx* c, struct zxmd_sa_Action_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Namespace, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_Action) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_Action_s* zxmd_NEW_sa_Action(struct zx_ctx* c)
{
  struct zxmd_sa_Action_s* x = ZX_ZALLOC(c, struct zxmd_sa_Action_s);
  x->gg.g.tok = zxmd_sa_Action_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_Action) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_Action(struct zx_ctx* c, struct zxmd_sa_Action_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_Action) */

int zxmd_WALK_WO_sa_Action(struct zx_ctx* c, struct zxmd_sa_Action_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_Advice
#define EL_STRUCT zxmd_sa_Advice_s
#define EL_NS     sa
#define EL_TAG    Advice

/* FUNC(zxmd_DUP_STRS_sa_Advice) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_Advice(struct zx_ctx* c, struct zxmd_sa_Advice_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  zx_dup_strs_simple_elems(c, x->AssertionIDRef);
  zx_dup_strs_simple_elems(c, x->AssertionURIRef);
  {
      struct zxmd_sa_Assertion_s* e;
      for (e = x->Assertion; e; e = (struct zxmd_sa_Assertion_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_Assertion(c, e);
  }
  {
      struct zxmd_sa_EncryptedAssertion_s* e;
      for (e = x->EncryptedAssertion; e; e = (struct zxmd_sa_EncryptedAssertion_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_EncryptedAssertion(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_sa_Advice) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_Advice_s* zxmd_DEEP_CLONE_sa_Advice(struct zx_ctx* c, struct zxmd_sa_Advice_s* x, int dup_strs)
{
  x = (struct zxmd_sa_Advice_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_Advice_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  x->AssertionIDRef = zx_deep_clone_simple_elems(c,x->AssertionIDRef, dup_strs);
  x->AssertionURIRef = zx_deep_clone_simple_elems(c,x->AssertionURIRef, dup_strs);
  {
      struct zxmd_sa_Assertion_s* e;
      struct zxmd_sa_Assertion_s* en;
      struct zxmd_sa_Assertion_s* enn;
      for (enn = 0, e = x->Assertion; e; e = (struct zxmd_sa_Assertion_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_Assertion(c, e, dup_strs);
	  if (!enn)
	      x->Assertion = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_EncryptedAssertion_s* e;
      struct zxmd_sa_EncryptedAssertion_s* en;
      struct zxmd_sa_EncryptedAssertion_s* enn;
      for (enn = 0, e = x->EncryptedAssertion; e; e = (struct zxmd_sa_EncryptedAssertion_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_EncryptedAssertion(c, e, dup_strs);
	  if (!enn)
	      x->EncryptedAssertion = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_sa_Advice) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_Advice(struct zx_ctx* c, struct zxmd_sa_Advice_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  zx_free_simple_elems(c, x->AssertionIDRef, free_strs);
  zx_free_simple_elems(c, x->AssertionURIRef, free_strs);
  {
      struct zxmd_sa_Assertion_s* e;
      struct zxmd_sa_Assertion_s* en;
      for (e = x->Assertion; e; e = en) {
	  en = (struct zxmd_sa_Assertion_s*)e->gg.g.n;
	  zxmd_FREE_sa_Assertion(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_EncryptedAssertion_s* e;
      struct zxmd_sa_EncryptedAssertion_s* en;
      for (e = x->EncryptedAssertion; e; e = en) {
	  en = (struct zxmd_sa_EncryptedAssertion_s*)e->gg.g.n;
	  zxmd_FREE_sa_EncryptedAssertion(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_Advice) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_Advice_s* zxmd_NEW_sa_Advice(struct zx_ctx* c)
{
  struct zxmd_sa_Advice_s* x = ZX_ZALLOC(c, struct zxmd_sa_Advice_s);
  x->gg.g.tok = zxmd_sa_Advice_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_Advice) */

