gitpan/zxid/c/saml2md-aux.c
/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_Advice(struct zx_ctx* c, struct zxmd_sa_Advice_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->AssertionIDRef, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->AssertionURIRef, ctx, callback);
  if (ret)
    return ret;
  {
      struct zxmd_sa_Assertion_s* e;
      for (e = x->Assertion; e; e = (struct zxmd_sa_Assertion_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_Assertion(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_EncryptedAssertion_s* e;
      for (e = x->EncryptedAssertion; e; e = (struct zxmd_sa_EncryptedAssertion_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_EncryptedAssertion(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_Advice) */

int zxmd_WALK_WO_sa_Advice(struct zx_ctx* c, struct zxmd_sa_Advice_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_Assertion
#define EL_STRUCT zxmd_sa_Assertion_s
#define EL_NS     sa
#define EL_TAG    Assertion

/* FUNC(zxmd_DUP_STRS_sa_Assertion) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_Assertion(struct zx_ctx* c, struct zxmd_sa_Assertion_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Version);
  zx_dup_attr(c, x->ID);
  zx_dup_attr(c, x->IssueInstant);

  {
      struct zxmd_sa_Issuer_s* e;
      for (e = x->Issuer; e; e = (struct zxmd_sa_Issuer_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_Issuer(c, e);
  }
  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Signature(c, e);
  }
  {
      struct zxmd_sa_Subject_s* e;
      for (e = x->Subject; e; e = (struct zxmd_sa_Subject_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_Subject(c, e);
  }
  {
      struct zxmd_sa_Conditions_s* e;
      for (e = x->Conditions; e; e = (struct zxmd_sa_Conditions_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_Conditions(c, e);
  }
  {
      struct zxmd_sa_Advice_s* e;
      for (e = x->Advice; e; e = (struct zxmd_sa_Advice_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_Advice(c, e);
  }
  zx_dup_strs_simple_elems(c, x->Statement);
  {
      struct zxmd_sa_AuthnStatement_s* e;
      for (e = x->AuthnStatement; e; e = (struct zxmd_sa_AuthnStatement_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_AuthnStatement(c, e);
  }
  {
      struct zxmd_sa_AuthzDecisionStatement_s* e;
      for (e = x->AuthzDecisionStatement; e; e = (struct zxmd_sa_AuthzDecisionStatement_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_AuthzDecisionStatement(c, e);
  }
  {
      struct zxmd_sa_AttributeStatement_s* e;
      for (e = x->AttributeStatement; e; e = (struct zxmd_sa_AttributeStatement_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_AttributeStatement(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_sa_Assertion) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_Assertion_s* zxmd_DEEP_CLONE_sa_Assertion(struct zx_ctx* c, struct zxmd_sa_Assertion_s* x, int dup_strs)
{
  x = (struct zxmd_sa_Assertion_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_Assertion_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Version = zx_clone_attr(c, x->Version);
  x->ID = zx_clone_attr(c, x->ID);
  x->IssueInstant = zx_clone_attr(c, x->IssueInstant);

  {
      struct zxmd_sa_Issuer_s* e;
      struct zxmd_sa_Issuer_s* en;
      struct zxmd_sa_Issuer_s* enn;
      for (enn = 0, e = x->Issuer; e; e = (struct zxmd_sa_Issuer_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_Issuer(c, e, dup_strs);
	  if (!enn)
	      x->Issuer = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      struct zxmd_ds_Signature_s* enn;
      for (enn = 0, e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Signature(c, e, dup_strs);
	  if (!enn)
	      x->Signature = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_Subject_s* e;
      struct zxmd_sa_Subject_s* en;
      struct zxmd_sa_Subject_s* enn;
      for (enn = 0, e = x->Subject; e; e = (struct zxmd_sa_Subject_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_Subject(c, e, dup_strs);
	  if (!enn)
	      x->Subject = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_Conditions_s* e;
      struct zxmd_sa_Conditions_s* en;
      struct zxmd_sa_Conditions_s* enn;
      for (enn = 0, e = x->Conditions; e; e = (struct zxmd_sa_Conditions_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_Conditions(c, e, dup_strs);
	  if (!enn)
	      x->Conditions = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_Advice_s* e;
      struct zxmd_sa_Advice_s* en;
      struct zxmd_sa_Advice_s* enn;
      for (enn = 0, e = x->Advice; e; e = (struct zxmd_sa_Advice_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_Advice(c, e, dup_strs);
	  if (!enn)
	      x->Advice = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  x->Statement = zx_deep_clone_simple_elems(c,x->Statement, dup_strs);
  {
      struct zxmd_sa_AuthnStatement_s* e;
      struct zxmd_sa_AuthnStatement_s* en;
      struct zxmd_sa_AuthnStatement_s* enn;
      for (enn = 0, e = x->AuthnStatement; e; e = (struct zxmd_sa_AuthnStatement_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_AuthnStatement(c, e, dup_strs);
	  if (!enn)
	      x->AuthnStatement = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_AuthzDecisionStatement_s* e;
      struct zxmd_sa_AuthzDecisionStatement_s* en;
      struct zxmd_sa_AuthzDecisionStatement_s* enn;
      for (enn = 0, e = x->AuthzDecisionStatement; e; e = (struct zxmd_sa_AuthzDecisionStatement_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_AuthzDecisionStatement(c, e, dup_strs);
	  if (!enn)
	      x->AuthzDecisionStatement = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_AttributeStatement_s* e;
      struct zxmd_sa_AttributeStatement_s* en;
      struct zxmd_sa_AttributeStatement_s* enn;
      for (enn = 0, e = x->AttributeStatement; e; e = (struct zxmd_sa_AttributeStatement_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_AttributeStatement(c, e, dup_strs);
	  if (!enn)
	      x->AttributeStatement = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_sa_Assertion) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

