gitpan/zxid/c/saml2md-aux.c
void zxmd_FREE_sa_Assertion(struct zx_ctx* c, struct zxmd_sa_Assertion_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Version, free_strs);
  zx_free_attr(c, x->ID, free_strs);
  zx_free_attr(c, x->IssueInstant, free_strs);

  {
      struct zxmd_sa_Issuer_s* e;
      struct zxmd_sa_Issuer_s* en;
      for (e = x->Issuer; e; e = en) {
	  en = (struct zxmd_sa_Issuer_s*)e->gg.g.n;
	  zxmd_FREE_sa_Issuer(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_Signature_s* e;
      struct zxmd_ds_Signature_s* en;
      for (e = x->Signature; e; e = en) {
	  en = (struct zxmd_ds_Signature_s*)e->gg.g.n;
	  zxmd_FREE_ds_Signature(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_Subject_s* e;
      struct zxmd_sa_Subject_s* en;
      for (e = x->Subject; e; e = en) {
	  en = (struct zxmd_sa_Subject_s*)e->gg.g.n;
	  zxmd_FREE_sa_Subject(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_Conditions_s* e;
      struct zxmd_sa_Conditions_s* en;
      for (e = x->Conditions; e; e = en) {
	  en = (struct zxmd_sa_Conditions_s*)e->gg.g.n;
	  zxmd_FREE_sa_Conditions(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_Advice_s* e;
      struct zxmd_sa_Advice_s* en;
      for (e = x->Advice; e; e = en) {
	  en = (struct zxmd_sa_Advice_s*)e->gg.g.n;
	  zxmd_FREE_sa_Advice(c, e, free_strs);
      }
  }
  zx_free_simple_elems(c, x->Statement, free_strs);
  {
      struct zxmd_sa_AuthnStatement_s* e;
      struct zxmd_sa_AuthnStatement_s* en;
      for (e = x->AuthnStatement; e; e = en) {
	  en = (struct zxmd_sa_AuthnStatement_s*)e->gg.g.n;
	  zxmd_FREE_sa_AuthnStatement(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_AuthzDecisionStatement_s* e;
      struct zxmd_sa_AuthzDecisionStatement_s* en;
      for (e = x->AuthzDecisionStatement; e; e = en) {
	  en = (struct zxmd_sa_AuthzDecisionStatement_s*)e->gg.g.n;
	  zxmd_FREE_sa_AuthzDecisionStatement(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_AttributeStatement_s* e;
      struct zxmd_sa_AttributeStatement_s* en;
      for (e = x->AttributeStatement; e; e = en) {
	  en = (struct zxmd_sa_AttributeStatement_s*)e->gg.g.n;
	  zxmd_FREE_sa_AttributeStatement(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_Assertion) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_Assertion_s* zxmd_NEW_sa_Assertion(struct zx_ctx* c)
{
  struct zxmd_sa_Assertion_s* x = ZX_ZALLOC(c, struct zxmd_sa_Assertion_s);
  x->gg.g.tok = zxmd_sa_Assertion_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_Assertion) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_Assertion(struct zx_ctx* c, struct zxmd_sa_Assertion_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_sa_Issuer_s* e;
      for (e = x->Issuer; e; e = (struct zxmd_sa_Issuer_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_Issuer(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zxmd_ds_Signature_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_Signature(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_Subject_s* e;
      for (e = x->Subject; e; e = (struct zxmd_sa_Subject_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_Subject(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_Conditions_s* e;
      for (e = x->Conditions; e; e = (struct zxmd_sa_Conditions_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_Conditions(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_Advice_s* e;
      for (e = x->Advice; e; e = (struct zxmd_sa_Advice_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_Advice(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  ret = zx_walk_so_simple_elems(c, x->Statement, ctx, callback);
  if (ret)
    return ret;
  {
      struct zxmd_sa_AuthnStatement_s* e;
      for (e = x->AuthnStatement; e; e = (struct zxmd_sa_AuthnStatement_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_AuthnStatement(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_AuthzDecisionStatement_s* e;
      for (e = x->AuthzDecisionStatement; e; e = (struct zxmd_sa_AuthzDecisionStatement_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_AuthzDecisionStatement(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_AttributeStatement_s* e;
      for (e = x->AttributeStatement; e; e = (struct zxmd_sa_AttributeStatement_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_AttributeStatement(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_Assertion) */

int zxmd_WALK_WO_sa_Assertion(struct zx_ctx* c, struct zxmd_sa_Assertion_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_Attribute
#define EL_STRUCT zxmd_sa_Attribute_s
#define EL_NS     sa
#define EL_TAG    Attribute

/* FUNC(zxmd_DUP_STRS_sa_Attribute) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_Attribute(struct zx_ctx* c, struct zxmd_sa_Attribute_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Name);
  zx_dup_attr(c, x->NameFormat);
  zx_dup_attr(c, x->FriendlyName);

