gitpan/zxid/c/saml2md-aux.c
#define EL_NAME   sa_BaseID
#define EL_STRUCT zxmd_sa_BaseID_s
#define EL_NS     sa
#define EL_TAG    BaseID

/* FUNC(zxmd_DUP_STRS_sa_BaseID) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_BaseID(struct zx_ctx* c, struct zxmd_sa_BaseID_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->NameQualifier);
  zx_dup_attr(c, x->SPNameQualifier);


}

/* FUNC(zxmd_DEEP_CLONE_sa_BaseID) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_BaseID_s* zxmd_DEEP_CLONE_sa_BaseID(struct zx_ctx* c, struct zxmd_sa_BaseID_s* x, int dup_strs)
{
  x = (struct zxmd_sa_BaseID_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_BaseID_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->NameQualifier = zx_clone_attr(c, x->NameQualifier);
  x->SPNameQualifier = zx_clone_attr(c, x->SPNameQualifier);


  return x;
}

/* FUNC(zxmd_FREE_sa_BaseID) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_BaseID(struct zx_ctx* c, struct zxmd_sa_BaseID_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->NameQualifier, free_strs);
  zx_free_attr(c, x->SPNameQualifier, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_BaseID) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_BaseID_s* zxmd_NEW_sa_BaseID(struct zx_ctx* c)
{
  struct zxmd_sa_BaseID_s* x = ZX_ZALLOC(c, struct zxmd_sa_BaseID_s);
  x->gg.g.tok = zxmd_sa_BaseID_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_BaseID) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_BaseID(struct zx_ctx* c, struct zxmd_sa_BaseID_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_BaseID) */

int zxmd_WALK_WO_sa_BaseID(struct zx_ctx* c, struct zxmd_sa_BaseID_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_Conditions
#define EL_STRUCT zxmd_sa_Conditions_s
#define EL_NS     sa
#define EL_TAG    Conditions

/* FUNC(zxmd_DUP_STRS_sa_Conditions) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_Conditions(struct zx_ctx* c, struct zxmd_sa_Conditions_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->NotBefore);
  zx_dup_attr(c, x->NotOnOrAfter);

  zx_dup_strs_simple_elems(c, x->Condition);
  {
      struct zxmd_sa_AudienceRestriction_s* e;
      for (e = x->AudienceRestriction; e; e = (struct zxmd_sa_AudienceRestriction_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_AudienceRestriction(c, e);
  }
  {
      struct zxmd_sa_OneTimeUse_s* e;
      for (e = x->OneTimeUse; e; e = (struct zxmd_sa_OneTimeUse_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_OneTimeUse(c, e);
  }
  {
      struct zxmd_sa_ProxyRestriction_s* e;
      for (e = x->ProxyRestriction; e; e = (struct zxmd_sa_ProxyRestriction_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_ProxyRestriction(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_sa_Conditions) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_Conditions_s* zxmd_DEEP_CLONE_sa_Conditions(struct zx_ctx* c, struct zxmd_sa_Conditions_s* x, int dup_strs)
{
  x = (struct zxmd_sa_Conditions_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_Conditions_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->NotBefore = zx_clone_attr(c, x->NotBefore);
  x->NotOnOrAfter = zx_clone_attr(c, x->NotOnOrAfter);

  x->Condition = zx_deep_clone_simple_elems(c,x->Condition, dup_strs);
  {
      struct zxmd_sa_AudienceRestriction_s* e;
      struct zxmd_sa_AudienceRestriction_s* en;
      struct zxmd_sa_AudienceRestriction_s* enn;
      for (enn = 0, e = x->AudienceRestriction; e; e = (struct zxmd_sa_AudienceRestriction_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_AudienceRestriction(c, e, dup_strs);
	  if (!enn)
	      x->AudienceRestriction = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_OneTimeUse_s* e;
      struct zxmd_sa_OneTimeUse_s* en;
      struct zxmd_sa_OneTimeUse_s* enn;
      for (enn = 0, e = x->OneTimeUse; e; e = (struct zxmd_sa_OneTimeUse_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_OneTimeUse(c, e, dup_strs);
	  if (!enn)
	      x->OneTimeUse = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_ProxyRestriction_s* e;
      struct zxmd_sa_ProxyRestriction_s* en;
      struct zxmd_sa_ProxyRestriction_s* enn;
      for (enn = 0, e = x->ProxyRestriction; e; e = (struct zxmd_sa_ProxyRestriction_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_ProxyRestriction(c, e, dup_strs);
	  if (!enn)
	      x->ProxyRestriction = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_sa_Conditions) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

