gitpan/zxid/c/saml2md-aux.c
void zxmd_FREE_sa_EncryptedAssertion(struct zx_ctx* c, struct zxmd_sa_EncryptedAssertion_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_xenc_EncryptedData_s* e;
      struct zxmd_xenc_EncryptedData_s* en;
      for (e = x->EncryptedData; e; e = en) {
	  en = (struct zxmd_xenc_EncryptedData_s*)e->gg.g.n;
	  zxmd_FREE_xenc_EncryptedData(c, e, free_strs);
      }
  }
  {
      struct zxmd_xenc_EncryptedKey_s* e;
      struct zxmd_xenc_EncryptedKey_s* en;
      for (e = x->EncryptedKey; e; e = en) {
	  en = (struct zxmd_xenc_EncryptedKey_s*)e->gg.g.n;
	  zxmd_FREE_xenc_EncryptedKey(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_EncryptedAssertion) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_EncryptedAssertion_s* zxmd_NEW_sa_EncryptedAssertion(struct zx_ctx* c)
{
  struct zxmd_sa_EncryptedAssertion_s* x = ZX_ZALLOC(c, struct zxmd_sa_EncryptedAssertion_s);
  x->gg.g.tok = zxmd_sa_EncryptedAssertion_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_EncryptedAssertion) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_EncryptedAssertion(struct zx_ctx* c, struct zxmd_sa_EncryptedAssertion_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_xenc_EncryptedData_s* e;
      for (e = x->EncryptedData; e; e = (struct zxmd_xenc_EncryptedData_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_xenc_EncryptedData(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_xenc_EncryptedKey_s* e;
      for (e = x->EncryptedKey; e; e = (struct zxmd_xenc_EncryptedKey_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_xenc_EncryptedKey(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_EncryptedAssertion) */

int zxmd_WALK_WO_sa_EncryptedAssertion(struct zx_ctx* c, struct zxmd_sa_EncryptedAssertion_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_EncryptedAttribute
#define EL_STRUCT zxmd_sa_EncryptedAttribute_s
#define EL_NS     sa
#define EL_TAG    EncryptedAttribute

/* FUNC(zxmd_DUP_STRS_sa_EncryptedAttribute) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_EncryptedAttribute(struct zx_ctx* c, struct zxmd_sa_EncryptedAttribute_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_xenc_EncryptedData_s* e;
      for (e = x->EncryptedData; e; e = (struct zxmd_xenc_EncryptedData_s*)e->gg.g.n)
	  zxmd_DUP_STRS_xenc_EncryptedData(c, e);
  }
  {
      struct zxmd_xenc_EncryptedKey_s* e;
      for (e = x->EncryptedKey; e; e = (struct zxmd_xenc_EncryptedKey_s*)e->gg.g.n)
	  zxmd_DUP_STRS_xenc_EncryptedKey(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_sa_EncryptedAttribute) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_EncryptedAttribute_s* zxmd_DEEP_CLONE_sa_EncryptedAttribute(struct zx_ctx* c, struct zxmd_sa_EncryptedAttribute_s* x, int dup_strs)
{
  x = (struct zxmd_sa_EncryptedAttribute_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_EncryptedAttribute_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_xenc_EncryptedData_s* e;
      struct zxmd_xenc_EncryptedData_s* en;
      struct zxmd_xenc_EncryptedData_s* enn;
      for (enn = 0, e = x->EncryptedData; e; e = (struct zxmd_xenc_EncryptedData_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_xenc_EncryptedData(c, e, dup_strs);
	  if (!enn)
	      x->EncryptedData = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_xenc_EncryptedKey_s* e;
      struct zxmd_xenc_EncryptedKey_s* en;
      struct zxmd_xenc_EncryptedKey_s* enn;
      for (enn = 0, e = x->EncryptedKey; e; e = (struct zxmd_xenc_EncryptedKey_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_xenc_EncryptedKey(c, e, dup_strs);
	  if (!enn)
	      x->EncryptedKey = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_sa_EncryptedAttribute) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_EncryptedAttribute(struct zx_ctx* c, struct zxmd_sa_EncryptedAttribute_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_xenc_EncryptedData_s* e;
      struct zxmd_xenc_EncryptedData_s* en;
      for (e = x->EncryptedData; e; e = en) {
	  en = (struct zxmd_xenc_EncryptedData_s*)e->gg.g.n;
	  zxmd_FREE_xenc_EncryptedData(c, e, free_strs);
      }
  }
  {
      struct zxmd_xenc_EncryptedKey_s* e;
      struct zxmd_xenc_EncryptedKey_s* en;
      for (e = x->EncryptedKey; e; e = en) {
	  en = (struct zxmd_xenc_EncryptedKey_s*)e->gg.g.n;
	  zxmd_FREE_xenc_EncryptedKey(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

