gitpan/zxid/c/saml2md-aux.c
}

/* FUNC(zxmd_DEEP_CLONE_sa_OneTimeUse) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_OneTimeUse_s* zxmd_DEEP_CLONE_sa_OneTimeUse(struct zx_ctx* c, struct zxmd_sa_OneTimeUse_s* x, int dup_strs)
{
  x = (struct zxmd_sa_OneTimeUse_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_OneTimeUse_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */



  return x;
}

/* FUNC(zxmd_FREE_sa_OneTimeUse) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_OneTimeUse(struct zx_ctx* c, struct zxmd_sa_OneTimeUse_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */




  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_OneTimeUse) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_OneTimeUse_s* zxmd_NEW_sa_OneTimeUse(struct zx_ctx* c)
{
  struct zxmd_sa_OneTimeUse_s* x = ZX_ZALLOC(c, struct zxmd_sa_OneTimeUse_s);
  x->gg.g.tok = zxmd_sa_OneTimeUse_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_OneTimeUse) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_OneTimeUse(struct zx_ctx* c, struct zxmd_sa_OneTimeUse_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_OneTimeUse) */

int zxmd_WALK_WO_sa_OneTimeUse(struct zx_ctx* c, struct zxmd_sa_OneTimeUse_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_ProxyRestriction
#define EL_STRUCT zxmd_sa_ProxyRestriction_s
#define EL_NS     sa
#define EL_TAG    ProxyRestriction

/* FUNC(zxmd_DUP_STRS_sa_ProxyRestriction) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_ProxyRestriction(struct zx_ctx* c, struct zxmd_sa_ProxyRestriction_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Count);

  zx_dup_strs_simple_elems(c, x->Audience);

}

/* FUNC(zxmd_DEEP_CLONE_sa_ProxyRestriction) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_ProxyRestriction_s* zxmd_DEEP_CLONE_sa_ProxyRestriction(struct zx_ctx* c, struct zxmd_sa_ProxyRestriction_s* x, int dup_strs)
{
  x = (struct zxmd_sa_ProxyRestriction_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_ProxyRestriction_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Count = zx_clone_attr(c, x->Count);

  x->Audience = zx_deep_clone_simple_elems(c,x->Audience, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_sa_ProxyRestriction) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_ProxyRestriction(struct zx_ctx* c, struct zxmd_sa_ProxyRestriction_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Count, free_strs);

  zx_free_simple_elems(c, x->Audience, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_ProxyRestriction) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_ProxyRestriction_s* zxmd_NEW_sa_ProxyRestriction(struct zx_ctx* c)
{
  struct zxmd_sa_ProxyRestriction_s* x = ZX_ZALLOC(c, struct zxmd_sa_ProxyRestriction_s);
  x->gg.g.tok = zxmd_sa_ProxyRestriction_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_ProxyRestriction) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_ProxyRestriction(struct zx_ctx* c, struct zxmd_sa_ProxyRestriction_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->Audience, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_ProxyRestriction) */

int zxmd_WALK_WO_sa_ProxyRestriction(struct zx_ctx* c, struct zxmd_sa_ProxyRestriction_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_Subject
#define EL_STRUCT zxmd_sa_Subject_s
#define EL_NS     sa
#define EL_TAG    Subject

/* FUNC(zxmd_DUP_STRS_sa_Subject) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_Subject(struct zx_ctx* c, struct zxmd_sa_Subject_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_sa_BaseID_s* e;
      for (e = x->BaseID; e; e = (struct zxmd_sa_BaseID_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_BaseID(c, e);
  }
  {
      struct zxmd_sa_NameID_s* e;
      for (e = x->NameID; e; e = (struct zxmd_sa_NameID_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_NameID(c, e);
  }
  {
      struct zxmd_sa_EncryptedID_s* e;
      for (e = x->EncryptedID; e; e = (struct zxmd_sa_EncryptedID_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_EncryptedID(c, e);
  }
  {
      struct zxmd_sa_SubjectConfirmation_s* e;
      for (e = x->SubjectConfirmation; e; e = (struct zxmd_sa_SubjectConfirmation_s*)e->gg.g.n)
	  zxmd_DUP_STRS_sa_SubjectConfirmation(c, e);
  }

