gitpan/zxid/c/saml2md-aux.c
}

/* FUNC(zxmd_DEEP_CLONE_sa_SubjectConfirmation) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_SubjectConfirmation_s* zxmd_DEEP_CLONE_sa_SubjectConfirmation(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmation_s* x, int dup_strs)
{
  x = (struct zxmd_sa_SubjectConfirmation_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_SubjectConfirmation_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Method = zx_clone_attr(c, x->Method);

  {
      struct zxmd_sa_BaseID_s* e;
      struct zxmd_sa_BaseID_s* en;
      struct zxmd_sa_BaseID_s* enn;
      for (enn = 0, e = x->BaseID; e; e = (struct zxmd_sa_BaseID_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_BaseID(c, e, dup_strs);
	  if (!enn)
	      x->BaseID = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_NameID_s* e;
      struct zxmd_sa_NameID_s* en;
      struct zxmd_sa_NameID_s* enn;
      for (enn = 0, e = x->NameID; e; e = (struct zxmd_sa_NameID_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_NameID(c, e, dup_strs);
	  if (!enn)
	      x->NameID = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_EncryptedID_s* e;
      struct zxmd_sa_EncryptedID_s* en;
      struct zxmd_sa_EncryptedID_s* enn;
      for (enn = 0, e = x->EncryptedID; e; e = (struct zxmd_sa_EncryptedID_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_EncryptedID(c, e, dup_strs);
	  if (!enn)
	      x->EncryptedID = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_sa_SubjectConfirmationData_s* e;
      struct zxmd_sa_SubjectConfirmationData_s* en;
      struct zxmd_sa_SubjectConfirmationData_s* enn;
      for (enn = 0, e = x->SubjectConfirmationData; e; e = (struct zxmd_sa_SubjectConfirmationData_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_sa_SubjectConfirmationData(c, e, dup_strs);
	  if (!enn)
	      x->SubjectConfirmationData = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_sa_SubjectConfirmation) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_SubjectConfirmation(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmation_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Method, free_strs);

  {
      struct zxmd_sa_BaseID_s* e;
      struct zxmd_sa_BaseID_s* en;
      for (e = x->BaseID; e; e = en) {
	  en = (struct zxmd_sa_BaseID_s*)e->gg.g.n;
	  zxmd_FREE_sa_BaseID(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_NameID_s* e;
      struct zxmd_sa_NameID_s* en;
      for (e = x->NameID; e; e = en) {
	  en = (struct zxmd_sa_NameID_s*)e->gg.g.n;
	  zxmd_FREE_sa_NameID(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_EncryptedID_s* e;
      struct zxmd_sa_EncryptedID_s* en;
      for (e = x->EncryptedID; e; e = en) {
	  en = (struct zxmd_sa_EncryptedID_s*)e->gg.g.n;
	  zxmd_FREE_sa_EncryptedID(c, e, free_strs);
      }
  }
  {
      struct zxmd_sa_SubjectConfirmationData_s* e;
      struct zxmd_sa_SubjectConfirmationData_s* en;
      for (e = x->SubjectConfirmationData; e; e = en) {
	  en = (struct zxmd_sa_SubjectConfirmationData_s*)e->gg.g.n;
	  zxmd_FREE_sa_SubjectConfirmationData(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_SubjectConfirmation) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_SubjectConfirmation_s* zxmd_NEW_sa_SubjectConfirmation(struct zx_ctx* c)
{
  struct zxmd_sa_SubjectConfirmation_s* x = ZX_ZALLOC(c, struct zxmd_sa_SubjectConfirmation_s);
  x->gg.g.tok = zxmd_sa_SubjectConfirmation_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_SubjectConfirmation) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_SubjectConfirmation(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmation_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_sa_BaseID_s* e;
      for (e = x->BaseID; e; e = (struct zxmd_sa_BaseID_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_BaseID(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_NameID_s* e;
      for (e = x->NameID; e; e = (struct zxmd_sa_NameID_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_NameID(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_EncryptedID_s* e;
      for (e = x->EncryptedID; e; e = (struct zxmd_sa_EncryptedID_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_EncryptedID(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_sa_SubjectConfirmationData_s* e;
      for (e = x->SubjectConfirmationData; e; e = (struct zxmd_sa_SubjectConfirmationData_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_sa_SubjectConfirmationData(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_SubjectConfirmation) */

int zxmd_WALK_WO_sa_SubjectConfirmation(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmation_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_SubjectConfirmationData
#define EL_STRUCT zxmd_sa_SubjectConfirmationData_s
#define EL_NS     sa
#define EL_TAG    SubjectConfirmationData

