gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_DUP_STRS_sa_SubjectConfirmationData) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_SubjectConfirmationData(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmationData_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->NotBefore);
  zx_dup_attr(c, x->NotOnOrAfter);
  zx_dup_attr(c, x->Recipient);
  zx_dup_attr(c, x->InResponseTo);
  zx_dup_attr(c, x->Address);


}

/* FUNC(zxmd_DEEP_CLONE_sa_SubjectConfirmationData) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_SubjectConfirmationData_s* zxmd_DEEP_CLONE_sa_SubjectConfirmationData(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmationData_s* x, int dup_strs)
{
  x = (struct zxmd_sa_SubjectConfirmationData_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_SubjectConfirmationData_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->NotBefore = zx_clone_attr(c, x->NotBefore);
  x->NotOnOrAfter = zx_clone_attr(c, x->NotOnOrAfter);
  x->Recipient = zx_clone_attr(c, x->Recipient);
  x->InResponseTo = zx_clone_attr(c, x->InResponseTo);
  x->Address = zx_clone_attr(c, x->Address);


  return x;
}

/* FUNC(zxmd_FREE_sa_SubjectConfirmationData) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_SubjectConfirmationData(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmationData_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->NotBefore, free_strs);
  zx_free_attr(c, x->NotOnOrAfter, free_strs);
  zx_free_attr(c, x->Recipient, free_strs);
  zx_free_attr(c, x->InResponseTo, free_strs);
  zx_free_attr(c, x->Address, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_SubjectConfirmationData) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_SubjectConfirmationData_s* zxmd_NEW_sa_SubjectConfirmationData(struct zx_ctx* c)
{
  struct zxmd_sa_SubjectConfirmationData_s* x = ZX_ZALLOC(c, struct zxmd_sa_SubjectConfirmationData_s);
  x->gg.g.tok = zxmd_sa_SubjectConfirmationData_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_SubjectConfirmationData) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_SubjectConfirmationData(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmationData_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_SubjectConfirmationData) */

int zxmd_WALK_WO_sa_SubjectConfirmationData(struct zx_ctx* c, struct zxmd_sa_SubjectConfirmationData_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_SubjectLocality
#define EL_STRUCT zxmd_sa_SubjectLocality_s
#define EL_NS     sa
#define EL_TAG    SubjectLocality

/* FUNC(zxmd_DUP_STRS_sa_SubjectLocality) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_SubjectLocality(struct zx_ctx* c, struct zxmd_sa_SubjectLocality_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Address);
  zx_dup_attr(c, x->DNSName);


}

/* FUNC(zxmd_DEEP_CLONE_sa_SubjectLocality) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_SubjectLocality_s* zxmd_DEEP_CLONE_sa_SubjectLocality(struct zx_ctx* c, struct zxmd_sa_SubjectLocality_s* x, int dup_strs)
{
  x = (struct zxmd_sa_SubjectLocality_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_SubjectLocality_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Address = zx_clone_attr(c, x->Address);
  x->DNSName = zx_clone_attr(c, x->DNSName);


  return x;
}

/* FUNC(zxmd_FREE_sa_SubjectLocality) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_SubjectLocality(struct zx_ctx* c, struct zxmd_sa_SubjectLocality_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Address, free_strs);
  zx_free_attr(c, x->DNSName, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_SubjectLocality) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_SubjectLocality_s* zxmd_NEW_sa_SubjectLocality(struct zx_ctx* c)
{
  struct zxmd_sa_SubjectLocality_s* x = ZX_ZALLOC(c, struct zxmd_sa_SubjectLocality_s);
  x->gg.g.tok = zxmd_sa_SubjectLocality_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_SubjectLocality) */

