gitpan/zxid/c/saml2md-aux.c
/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_SubjectLocality(struct zx_ctx* c, struct zxmd_sa_SubjectLocality_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_SubjectLocality) */

int zxmd_WALK_WO_sa_SubjectLocality(struct zx_ctx* c, struct zxmd_sa_SubjectLocality_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sa_TestElem
#define EL_STRUCT zxmd_sa_TestElem_s
#define EL_NS     sa
#define EL_TAG    TestElem

/* FUNC(zxmd_DUP_STRS_sa_TestElem) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_sa_TestElem(struct zx_ctx* c, struct zxmd_sa_TestElem_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  zx_dup_strs_simple_elems(c, x->AttributeValue);

}

/* FUNC(zxmd_DEEP_CLONE_sa_TestElem) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_sa_TestElem_s* zxmd_DEEP_CLONE_sa_TestElem(struct zx_ctx* c, struct zxmd_sa_TestElem_s* x, int dup_strs)
{
  x = (struct zxmd_sa_TestElem_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_sa_TestElem_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  x->AttributeValue = zx_deep_clone_simple_elems(c,x->AttributeValue, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_sa_TestElem) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_sa_TestElem(struct zx_ctx* c, struct zxmd_sa_TestElem_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  zx_free_simple_elems(c, x->AttributeValue, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_sa_TestElem) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_sa_TestElem_s* zxmd_NEW_sa_TestElem(struct zx_ctx* c)
{
  struct zxmd_sa_TestElem_s* x = ZX_ZALLOC(c, struct zxmd_sa_TestElem_s);
  x->gg.g.tok = zxmd_sa_TestElem_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_sa_TestElem) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_sa_TestElem(struct zx_ctx* c, struct zxmd_sa_TestElem_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->AttributeValue, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_sa_TestElem) */

int zxmd_WALK_WO_sa_TestElem(struct zx_ctx* c, struct zxmd_sa_TestElem_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_AgreementMethod
#define EL_STRUCT zxmd_xenc_AgreementMethod_s
#define EL_NS     xenc
#define EL_TAG    AgreementMethod

/* FUNC(zxmd_DUP_STRS_xenc_AgreementMethod) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_xenc_AgreementMethod(struct zx_ctx* c, struct zxmd_xenc_AgreementMethod_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Algorithm);

  zx_dup_strs_simple_elems(c, x->KA_Nonce);
  {
      struct zxmd_xenc_OriginatorKeyInfo_s* e;
      for (e = x->OriginatorKeyInfo; e; e = (struct zxmd_xenc_OriginatorKeyInfo_s*)e->gg.g.n)
	  zxmd_DUP_STRS_xenc_OriginatorKeyInfo(c, e);
  }
  {
      struct zxmd_xenc_RecipientKeyInfo_s* e;
      for (e = x->RecipientKeyInfo; e; e = (struct zxmd_xenc_RecipientKeyInfo_s*)e->gg.g.n)
	  zxmd_DUP_STRS_xenc_RecipientKeyInfo(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_xenc_AgreementMethod) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_xenc_AgreementMethod_s* zxmd_DEEP_CLONE_xenc_AgreementMethod(struct zx_ctx* c, struct zxmd_xenc_AgreementMethod_s* x, int dup_strs)
{
  x = (struct zxmd_xenc_AgreementMethod_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_xenc_AgreementMethod_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

