gitpan/zxid/c/saml2md-aux.c
}

/* FUNC(zxmd_DEEP_CLONE_xenc_DataReference) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_xenc_DataReference_s* zxmd_DEEP_CLONE_xenc_DataReference(struct zx_ctx* c, struct zxmd_xenc_DataReference_s* x, int dup_strs)
{
  x = (struct zxmd_xenc_DataReference_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_xenc_DataReference_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->URI = zx_clone_attr(c, x->URI);


  return x;
}

/* FUNC(zxmd_FREE_xenc_DataReference) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_xenc_DataReference(struct zx_ctx* c, struct zxmd_xenc_DataReference_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->URI, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_xenc_DataReference) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_xenc_DataReference_s* zxmd_NEW_xenc_DataReference(struct zx_ctx* c)
{
  struct zxmd_xenc_DataReference_s* x = ZX_ZALLOC(c, struct zxmd_xenc_DataReference_s);
  x->gg.g.tok = zxmd_xenc_DataReference_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_xenc_DataReference) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_xenc_DataReference(struct zx_ctx* c, struct zxmd_xenc_DataReference_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_xenc_DataReference) */

int zxmd_WALK_WO_xenc_DataReference(struct zx_ctx* c, struct zxmd_xenc_DataReference_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_EncryptedData
#define EL_STRUCT zxmd_xenc_EncryptedData_s
#define EL_NS     xenc
#define EL_TAG    EncryptedData

/* FUNC(zxmd_DUP_STRS_xenc_EncryptedData) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_xenc_EncryptedData(struct zx_ctx* c, struct zxmd_xenc_EncryptedData_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Id);
  zx_dup_attr(c, x->Type);
  zx_dup_attr(c, x->MimeType);
  zx_dup_attr(c, x->Encoding);

  {
      struct zxmd_xenc_EncryptionMethod_s* e;
      for (e = x->EncryptionMethod; e; e = (struct zxmd_xenc_EncryptionMethod_s*)e->gg.g.n)
	  zxmd_DUP_STRS_xenc_EncryptionMethod(c, e);
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_KeyInfo(c, e);
  }
  {
      struct zxmd_xenc_CipherData_s* e;
      for (e = x->CipherData; e; e = (struct zxmd_xenc_CipherData_s*)e->gg.g.n)
	  zxmd_DUP_STRS_xenc_CipherData(c, e);
  }
  {
      struct zxmd_xenc_EncryptionProperties_s* e;
      for (e = x->EncryptionProperties; e; e = (struct zxmd_xenc_EncryptionProperties_s*)e->gg.g.n)
	  zxmd_DUP_STRS_xenc_EncryptionProperties(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_xenc_EncryptedData) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_xenc_EncryptedData_s* zxmd_DEEP_CLONE_xenc_EncryptedData(struct zx_ctx* c, struct zxmd_xenc_EncryptedData_s* x, int dup_strs)
{
  x = (struct zxmd_xenc_EncryptedData_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_xenc_EncryptedData_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);
  x->Type = zx_clone_attr(c, x->Type);
  x->MimeType = zx_clone_attr(c, x->MimeType);
  x->Encoding = zx_clone_attr(c, x->Encoding);

  {
      struct zxmd_xenc_EncryptionMethod_s* e;
      struct zxmd_xenc_EncryptionMethod_s* en;
      struct zxmd_xenc_EncryptionMethod_s* enn;
      for (enn = 0, e = x->EncryptionMethod; e; e = (struct zxmd_xenc_EncryptionMethod_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_xenc_EncryptionMethod(c, e, dup_strs);
	  if (!enn)
	      x->EncryptionMethod = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      struct zxmd_ds_KeyInfo_s* en;
      struct zxmd_ds_KeyInfo_s* enn;
      for (enn = 0, e = x->KeyInfo; e; e = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_KeyInfo(c, e, dup_strs);
	  if (!enn)
	      x->KeyInfo = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_xenc_CipherData_s* e;
      struct zxmd_xenc_CipherData_s* en;
      struct zxmd_xenc_CipherData_s* enn;
      for (enn = 0, e = x->CipherData; e; e = (struct zxmd_xenc_CipherData_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_xenc_CipherData(c, e, dup_strs);
	  if (!enn)
	      x->CipherData = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_xenc_EncryptionProperties_s* e;
      struct zxmd_xenc_EncryptionProperties_s* en;
      struct zxmd_xenc_EncryptionProperties_s* enn;
      for (enn = 0, e = x->EncryptionProperties; e; e = (struct zxmd_xenc_EncryptionProperties_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_xenc_EncryptionProperties(c, e, dup_strs);
	  if (!enn)
	      x->EncryptionProperties = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_xenc_EncryptedData) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_xenc_EncryptedData(struct zx_ctx* c, struct zxmd_xenc_EncryptedData_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);
  zx_free_attr(c, x->Type, free_strs);
  zx_free_attr(c, x->MimeType, free_strs);
  zx_free_attr(c, x->Encoding, free_strs);

  {
      struct zxmd_xenc_EncryptionMethod_s* e;
      struct zxmd_xenc_EncryptionMethod_s* en;
      for (e = x->EncryptionMethod; e; e = en) {
	  en = (struct zxmd_xenc_EncryptionMethod_s*)e->gg.g.n;
	  zxmd_FREE_xenc_EncryptionMethod(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_KeyInfo_s* e;
      struct zxmd_ds_KeyInfo_s* en;
      for (e = x->KeyInfo; e; e = en) {
	  en = (struct zxmd_ds_KeyInfo_s*)e->gg.g.n;
	  zxmd_FREE_ds_KeyInfo(c, e, free_strs);
      }
  }
  {
      struct zxmd_xenc_CipherData_s* e;
      struct zxmd_xenc_CipherData_s* en;
      for (e = x->CipherData; e; e = en) {
	  en = (struct zxmd_xenc_CipherData_s*)e->gg.g.n;
	  zxmd_FREE_xenc_CipherData(c, e, free_strs);
      }
  }
  {
      struct zxmd_xenc_EncryptionProperties_s* e;
      struct zxmd_xenc_EncryptionProperties_s* en;
      for (e = x->EncryptionProperties; e; e = en) {
	  en = (struct zxmd_xenc_EncryptionProperties_s*)e->gg.g.n;
	  zxmd_FREE_xenc_EncryptionProperties(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

