gitpan/zxid/c/saml2md-aux.c
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_xenc_EncryptionProperty_s* e;
      for (e = x->EncryptionProperty; e; e = (struct zxmd_xenc_EncryptionProperty_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_xenc_EncryptionProperty(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_xenc_EncryptionProperties) */

int zxmd_WALK_WO_xenc_EncryptionProperties(struct zx_ctx* c, struct zxmd_xenc_EncryptionProperties_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_EncryptionProperty
#define EL_STRUCT zxmd_xenc_EncryptionProperty_s
#define EL_NS     xenc
#define EL_TAG    EncryptionProperty

/* FUNC(zxmd_DUP_STRS_xenc_EncryptionProperty) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_xenc_EncryptionProperty(struct zx_ctx* c, struct zxmd_xenc_EncryptionProperty_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Target);
  zx_dup_attr(c, x->Id);


}

/* FUNC(zxmd_DEEP_CLONE_xenc_EncryptionProperty) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_xenc_EncryptionProperty_s* zxmd_DEEP_CLONE_xenc_EncryptionProperty(struct zx_ctx* c, struct zxmd_xenc_EncryptionProperty_s* x, int dup_strs)
{
  x = (struct zxmd_xenc_EncryptionProperty_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_xenc_EncryptionProperty_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Target = zx_clone_attr(c, x->Target);
  x->Id = zx_clone_attr(c, x->Id);


  return x;
}

/* FUNC(zxmd_FREE_xenc_EncryptionProperty) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_xenc_EncryptionProperty(struct zx_ctx* c, struct zxmd_xenc_EncryptionProperty_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Target, free_strs);
  zx_free_attr(c, x->Id, free_strs);



  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_xenc_EncryptionProperty) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_xenc_EncryptionProperty_s* zxmd_NEW_xenc_EncryptionProperty(struct zx_ctx* c)
{
  struct zxmd_xenc_EncryptionProperty_s* x = ZX_ZALLOC(c, struct zxmd_xenc_EncryptionProperty_s);
  x->gg.g.tok = zxmd_xenc_EncryptionProperty_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_xenc_EncryptionProperty) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_xenc_EncryptionProperty(struct zx_ctx* c, struct zxmd_xenc_EncryptionProperty_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_xenc_EncryptionProperty) */

int zxmd_WALK_WO_xenc_EncryptionProperty(struct zx_ctx* c, struct zxmd_xenc_EncryptionProperty_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_KeyReference
#define EL_STRUCT zxmd_xenc_KeyReference_s
#define EL_NS     xenc
#define EL_TAG    KeyReference

/* FUNC(zxmd_DUP_STRS_xenc_KeyReference) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_xenc_KeyReference(struct zx_ctx* c, struct zxmd_xenc_KeyReference_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->URI);


}

/* FUNC(zxmd_DEEP_CLONE_xenc_KeyReference) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_xenc_KeyReference_s* zxmd_DEEP_CLONE_xenc_KeyReference(struct zx_ctx* c, struct zxmd_xenc_KeyReference_s* x, int dup_strs)
{
  x = (struct zxmd_xenc_KeyReference_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_xenc_KeyReference_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->URI = zx_clone_attr(c, x->URI);


  return x;
}

/* FUNC(zxmd_FREE_xenc_KeyReference) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

