gitpan/zxid/c/saml2md-aux.c
/* FUNC(zxmd_NEW_xenc_OriginatorKeyInfo) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_xenc_OriginatorKeyInfo_s* zxmd_NEW_xenc_OriginatorKeyInfo(struct zx_ctx* c)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* x = ZX_ZALLOC(c, struct zxmd_xenc_OriginatorKeyInfo_s);
  x->gg.g.tok = zxmd_xenc_OriginatorKeyInfo_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_xenc_OriginatorKeyInfo) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_xenc_OriginatorKeyInfo(struct zx_ctx* c, struct zxmd_xenc_OriginatorKeyInfo_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  ret = zx_walk_so_simple_elems(c, x->KeyName, ctx, callback);
  if (ret)
    return ret;
  {
      struct zxmd_ds_KeyValue_s* e;
      for (e = x->KeyValue; e; e = (struct zxmd_ds_KeyValue_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_KeyValue(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_RetrievalMethod_s* e;
      for (e = x->RetrievalMethod; e; e = (struct zxmd_ds_RetrievalMethod_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_RetrievalMethod(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_X509Data_s* e;
      for (e = x->X509Data; e; e = (struct zxmd_ds_X509Data_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_X509Data(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_PGPData_s* e;
      for (e = x->PGPData; e; e = (struct zxmd_ds_PGPData_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_PGPData(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_ds_SPKIData_s* e;
      for (e = x->SPKIData; e; e = (struct zxmd_ds_SPKIData_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_SPKIData(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  ret = zx_walk_so_simple_elems(c, x->MgmtData, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_xenc_OriginatorKeyInfo) */

int zxmd_WALK_WO_xenc_OriginatorKeyInfo(struct zx_ctx* c, struct zxmd_xenc_OriginatorKeyInfo_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_RecipientKeyInfo
#define EL_STRUCT zxmd_xenc_RecipientKeyInfo_s
#define EL_NS     xenc
#define EL_TAG    RecipientKeyInfo

/* FUNC(zxmd_DUP_STRS_xenc_RecipientKeyInfo) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_xenc_RecipientKeyInfo(struct zx_ctx* c, struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Id);

  zx_dup_strs_simple_elems(c, x->KeyName);
  {
      struct zxmd_ds_KeyValue_s* e;
      for (e = x->KeyValue; e; e = (struct zxmd_ds_KeyValue_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_KeyValue(c, e);
  }
  {
      struct zxmd_ds_RetrievalMethod_s* e;
      for (e = x->RetrievalMethod; e; e = (struct zxmd_ds_RetrievalMethod_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_RetrievalMethod(c, e);
  }
  {
      struct zxmd_ds_X509Data_s* e;
      for (e = x->X509Data; e; e = (struct zxmd_ds_X509Data_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_X509Data(c, e);
  }
  {
      struct zxmd_ds_PGPData_s* e;
      for (e = x->PGPData; e; e = (struct zxmd_ds_PGPData_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_PGPData(c, e);
  }
  {
      struct zxmd_ds_SPKIData_s* e;
      for (e = x->SPKIData; e; e = (struct zxmd_ds_SPKIData_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_SPKIData(c, e);
  }
  zx_dup_strs_simple_elems(c, x->MgmtData);

}

/* FUNC(zxmd_DEEP_CLONE_xenc_RecipientKeyInfo) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_xenc_RecipientKeyInfo_s* zxmd_DEEP_CLONE_xenc_RecipientKeyInfo(struct zx_ctx* c, struct zxmd_xenc_RecipientKeyInfo_s* x, int dup_strs)
{
  x = (struct zxmd_xenc_RecipientKeyInfo_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_xenc_RecipientKeyInfo_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);

  x->KeyName = zx_deep_clone_simple_elems(c,x->KeyName, dup_strs);
  {
      struct zxmd_ds_KeyValue_s* e;
      struct zxmd_ds_KeyValue_s* en;
      struct zxmd_ds_KeyValue_s* enn;
      for (enn = 0, e = x->KeyValue; e; e = (struct zxmd_ds_KeyValue_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_KeyValue(c, e, dup_strs);
	  if (!enn)
	      x->KeyValue = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_RetrievalMethod_s* e;
      struct zxmd_ds_RetrievalMethod_s* en;
      struct zxmd_ds_RetrievalMethod_s* enn;
      for (enn = 0, e = x->RetrievalMethod; e; e = (struct zxmd_ds_RetrievalMethod_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_RetrievalMethod(c, e, dup_strs);
	  if (!enn)
	      x->RetrievalMethod = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_X509Data_s* e;
      struct zxmd_ds_X509Data_s* en;
      struct zxmd_ds_X509Data_s* enn;
      for (enn = 0, e = x->X509Data; e; e = (struct zxmd_ds_X509Data_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_X509Data(c, e, dup_strs);
	  if (!enn)
	      x->X509Data = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_PGPData_s* e;
      struct zxmd_ds_PGPData_s* en;
      struct zxmd_ds_PGPData_s* enn;
      for (enn = 0, e = x->PGPData; e; e = (struct zxmd_ds_PGPData_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_PGPData(c, e, dup_strs);
	  if (!enn)
	      x->PGPData = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_ds_SPKIData_s* e;
      struct zxmd_ds_SPKIData_s* en;
      struct zxmd_ds_SPKIData_s* enn;
      for (enn = 0, e = x->SPKIData; e; e = (struct zxmd_ds_SPKIData_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_SPKIData(c, e, dup_strs);
	  if (!enn)
	      x->SPKIData = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  x->MgmtData = zx_deep_clone_simple_elems(c,x->MgmtData, dup_strs);

  return x;
}

/* FUNC(zxmd_FREE_xenc_RecipientKeyInfo) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_xenc_RecipientKeyInfo(struct zx_ctx* c, struct zxmd_xenc_RecipientKeyInfo_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);

  zx_free_simple_elems(c, x->KeyName, free_strs);
  {
      struct zxmd_ds_KeyValue_s* e;
      struct zxmd_ds_KeyValue_s* en;
      for (e = x->KeyValue; e; e = en) {
	  en = (struct zxmd_ds_KeyValue_s*)e->gg.g.n;
	  zxmd_FREE_ds_KeyValue(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_RetrievalMethod_s* e;
      struct zxmd_ds_RetrievalMethod_s* en;
      for (e = x->RetrievalMethod; e; e = en) {
	  en = (struct zxmd_ds_RetrievalMethod_s*)e->gg.g.n;
	  zxmd_FREE_ds_RetrievalMethod(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_X509Data_s* e;
      struct zxmd_ds_X509Data_s* en;
      for (e = x->X509Data; e; e = en) {
	  en = (struct zxmd_ds_X509Data_s*)e->gg.g.n;
	  zxmd_FREE_ds_X509Data(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_PGPData_s* e;
      struct zxmd_ds_PGPData_s* en;
      for (e = x->PGPData; e; e = en) {
	  en = (struct zxmd_ds_PGPData_s*)e->gg.g.n;
	  zxmd_FREE_ds_PGPData(c, e, free_strs);
      }
  }
  {
      struct zxmd_ds_SPKIData_s* e;
      struct zxmd_ds_SPKIData_s* en;
      for (e = x->SPKIData; e; e = en) {
	  en = (struct zxmd_ds_SPKIData_s*)e->gg.g.n;
	  zxmd_FREE_ds_SPKIData(c, e, free_strs);
      }
  }
  zx_free_simple_elems(c, x->MgmtData, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_xenc_RecipientKeyInfo) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_xenc_RecipientKeyInfo_s* zxmd_NEW_xenc_RecipientKeyInfo(struct zx_ctx* c)
{
  struct zxmd_xenc_RecipientKeyInfo_s* x = ZX_ZALLOC(c, struct zxmd_xenc_RecipientKeyInfo_s);
  x->gg.g.tok = zxmd_xenc_RecipientKeyInfo_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_xenc_RecipientKeyInfo) */

