gitpan/zxid/c/saml2md-aux.c
/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_xenc_ReferenceList(struct zx_ctx* c, struct zxmd_xenc_ReferenceList_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_xenc_DataReference_s* e;
      for (e = x->DataReference; e; e = (struct zxmd_xenc_DataReference_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_xenc_DataReference(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_xenc_KeyReference_s* e;
      for (e = x->KeyReference; e; e = (struct zxmd_xenc_KeyReference_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_xenc_KeyReference(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_xenc_ReferenceList) */

int zxmd_WALK_WO_xenc_ReferenceList(struct zx_ctx* c, struct zxmd_xenc_ReferenceList_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   xenc_Transforms
#define EL_STRUCT zxmd_xenc_Transforms_s
#define EL_NS     xenc
#define EL_TAG    Transforms

/* FUNC(zxmd_DUP_STRS_xenc_Transforms) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_xenc_Transforms(struct zx_ctx* c, struct zxmd_xenc_Transforms_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_ds_Transform_s* e;
      for (e = x->Transform; e; e = (struct zxmd_ds_Transform_s*)e->gg.g.n)
	  zxmd_DUP_STRS_ds_Transform(c, e);
  }

}

/* FUNC(zxmd_DEEP_CLONE_xenc_Transforms) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_xenc_Transforms_s* zxmd_DEEP_CLONE_xenc_Transforms(struct zx_ctx* c, struct zxmd_xenc_Transforms_s* x, int dup_strs)
{
  x = (struct zxmd_xenc_Transforms_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_xenc_Transforms_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_ds_Transform_s* e;
      struct zxmd_ds_Transform_s* en;
      struct zxmd_ds_Transform_s* enn;
      for (enn = 0, e = x->Transform; e; e = (struct zxmd_ds_Transform_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_ds_Transform(c, e, dup_strs);
	  if (!enn)
	      x->Transform = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_xenc_Transforms) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_xenc_Transforms(struct zx_ctx* c, struct zxmd_xenc_Transforms_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_ds_Transform_s* e;
      struct zxmd_ds_Transform_s* en;
      for (e = x->Transform; e; e = en) {
	  en = (struct zxmd_ds_Transform_s*)e->gg.g.n;
	  zxmd_FREE_ds_Transform(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_xenc_Transforms) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_xenc_Transforms_s* zxmd_NEW_xenc_Transforms(struct zx_ctx* c)
{
  struct zxmd_xenc_Transforms_s* x = ZX_ZALLOC(c, struct zxmd_xenc_Transforms_s);
  x->gg.g.tok = zxmd_xenc_Transforms_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_xenc_Transforms) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_xenc_Transforms(struct zx_ctx* c, struct zxmd_xenc_Transforms_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_ds_Transform_s* e;
      for (e = x->Transform; e; e = (struct zxmd_ds_Transform_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_ds_Transform(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_xenc_Transforms) */

int zxmd_WALK_WO_xenc_Transforms(struct zx_ctx* c, struct zxmd_xenc_Transforms_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   root
#define EL_STRUCT zxmd_root_s
#define EL_NS     
#define EL_TAG    root

/* FUNC(zxmd_DUP_STRS_root) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_root(struct zx_ctx* c, struct zxmd_root_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_md_EntityDescriptor_s* e;
      for (e = x->EntityDescriptor; e; e = (struct zxmd_md_EntityDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_EntityDescriptor(c, e);
  }
  {
      struct zxmd_md_EntitiesDescriptor_s* e;
      for (e = x->EntitiesDescriptor; e; e = (struct zxmd_md_EntitiesDescriptor_s*)e->gg.g.n)
	  zxmd_DUP_STRS_md_EntitiesDescriptor(c, e);
  }

