gitpan/zxid/c/saml2md-aux.c
}

/* FUNC(zxmd_DEEP_CLONE_root) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zxmd_root_s* zxmd_DEEP_CLONE_root(struct zx_ctx* c, struct zxmd_root_s* x, int dup_strs)
{
  x = (struct zxmd_root_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zxmd_root_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_md_EntityDescriptor_s* e;
      struct zxmd_md_EntityDescriptor_s* en;
      struct zxmd_md_EntityDescriptor_s* enn;
      for (enn = 0, e = x->EntityDescriptor; e; e = (struct zxmd_md_EntityDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_EntityDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->EntityDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zxmd_md_EntitiesDescriptor_s* e;
      struct zxmd_md_EntitiesDescriptor_s* en;
      struct zxmd_md_EntitiesDescriptor_s* enn;
      for (enn = 0, e = x->EntitiesDescriptor; e; e = (struct zxmd_md_EntitiesDescriptor_s*)e->gg.g.n) {
	  en = zxmd_DEEP_CLONE_md_EntitiesDescriptor(c, e, dup_strs);
	  if (!enn)
	      x->EntitiesDescriptor = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zxmd_FREE_root) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_root(struct zx_ctx* c, struct zxmd_root_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zxmd_md_EntityDescriptor_s* e;
      struct zxmd_md_EntityDescriptor_s* en;
      for (e = x->EntityDescriptor; e; e = en) {
	  en = (struct zxmd_md_EntityDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_EntityDescriptor(c, e, free_strs);
      }
  }
  {
      struct zxmd_md_EntitiesDescriptor_s* e;
      struct zxmd_md_EntitiesDescriptor_s* en;
      for (e = x->EntitiesDescriptor; e; e = en) {
	  en = (struct zxmd_md_EntitiesDescriptor_s*)e->gg.g.n;
	  zxmd_FREE_md_EntitiesDescriptor(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zxmd_NEW_root) */

/* Trivial allocator/constructor for the datatype. */

struct zxmd_root_s* zxmd_NEW_root(struct zx_ctx* c)
{
  struct zxmd_root_s* x = ZX_ZALLOC(c, struct zxmd_root_s);
  x->gg.g.tok = zxmd_root_ELEM;
  return x;
}

/* FUNC(zxmd_WALK_SO_root) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_root(struct zx_ctx* c, struct zxmd_root_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zxmd_md_EntityDescriptor_s* e;
      for (e = x->EntityDescriptor; e; e = (struct zxmd_md_EntityDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_EntityDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zxmd_md_EntitiesDescriptor_s* e;
      for (e = x->EntitiesDescriptor; e; e = (struct zxmd_md_EntitiesDescriptor_s*)e->gg.g.n) {
	  ret = zxmd_WALK_SO_md_EntitiesDescriptor(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_root) */

int zxmd_WALK_WO_root(struct zx_ctx* c, struct zxmd_root_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   simple_elem
#define EL_STRUCT zx_elem_s
#define EL_NS     
#define EL_TAG    simple_elem

/* FUNC(zxmd_DUP_STRS_simple_elem) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zxmd_DUP_STRS_simple_elem(struct zx_ctx* c, struct zx_elem_s* x)
{
  zx_dup_strs_common(c, x);
  /* *** deal with xmlns specifications in exc c14n way */



}

/* FUNC(zxmd_DEEP_CLONE_simple_elem) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zx_elem_s* zxmd_DEEP_CLONE_simple_elem(struct zx_ctx* c, struct zx_elem_s* x, int dup_strs)
{
  x = (struct zx_elem_s*)zx_clone_elem_common(c, x, sizeof(struct zx_elem_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */



  return x;
}

/* FUNC(zxmd_FREE_simple_elem) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zxmd_FREE_simple_elem(struct zx_ctx* c, struct zx_elem_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */




  zx_free_elem_common(c, x, free_strs); 
}

/* FUNC(zxmd_NEW_simple_elem) */

/* Trivial allocator/constructor for the datatype. */

struct zx_elem_s* zxmd_NEW_simple_elem(struct zx_ctx* c, int toke)
{
  struct zx_elem_s* x = ZX_ZALLOC(c, struct zx_elem_s);
  x->g.tok = toke;
  return x;
}

/* FUNC(zxmd_WALK_SO_simple_elem) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zxmd_WALK_SO_simple_elem(struct zx_ctx* c, struct zx_elem_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, x, ctx, callback); 
  if (ret)
    return ret;


  
  return zx_walk_so_unknown_elems_and_content(c, x, ctx, callback);
}

/* FUNC(zxmd_WALK_WO_simple_elem) */

int zxmd_WALK_WO_simple_elem(struct zx_ctx* c, struct zx_elem_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}


